{"url": "https://creepypasta.fandom.com/wiki/%22Geraldine%22_Atkins", "title": "%22Geraldine%22 Atkins", "author": "Unknown", "publication_date": null, "tags": ["Dismemberment", "Mental Illness", "Music", "NSFW"], "content": "“Great Britain, Great Britain, Great Britain… On the parchment of history ‘tis written O, how our enemies shall soon be smitten Great Britain, Great Britain, Great Britain… “Great Britain, Great Britain, Great Britain… On the parchment of history ‘tis written O, how our enemies shall soon be smitten Great Britain, Great Britain, Great Britain… As Geraldine pulled into his driveway, he parked and moved carefully out of his old banger of a car. Then, not forgetting his parasol and his walking stick, he entered his old cottage. He carefully balanced his stick and his parasol in the closet, then walked into the kitchen. He put on the kettle, and as he did, Grimalkin purred as she leapt up near the kitchen sink. He gently stroked her black fur, as the kettle grew noisier. Then he remembered to feed her. “There’s a good puss… good girl…” he murmured. Once the kettle was singing, he poured himself some Earl Grey, gently blew over it, and then took a sip. “Let’s let Susie in the bedroom!” “No Susie can’t be there, it’s not her bedtime!” Just at that moment, Mother walked in, with a wide-eyed toddler beside her. “Girls?” she called out. “Gerald wants to play with you. Are you going to let him?” Annabel sighed. Not this again. Why couldn’t Gerald play with his own friends? “But Mummy! Gerald’s a boy! Boys can’t play with us!” Mother cooed. “Please… look at him. He loves his big sister. He desperately wants to play with you. Don’t you dear, Gerald?” Gerald looked really happy, but didn’t know how to express himself. “I don’t want to hear any arguing. Is that clear? Just let Gerald play with your dolls, and be nice to him.” Gerald toddled over to his older sister, and pointed to the house, which was almost bigger than he was. In an effort to get attention, he announced in front of Annabel and her friends, in as much English as he could, “It’s big!” Annabel’s friends were beginning to feel sorry for him. “Come over here, Gerald, help Susan get dressed for her day at school.” “No! Wendy! Gerald can’t play with dolls! Don’t let him touch her!” “I know!” shouted Barbara, with sudden excitement. “Let’s turn him into a girl!” The other girls snickered at this. Gerald was happy that he was getting all this lovely attention. “No, you can’t do that Barbara!” Annabel retorted, as if she was telling her off. “Yes we can!” shouted Daisy. “All we need to do is make him wear a dress!” “He looks beautiful!” said Daisy. “He’s still not one of us” she muttered, obstinately… “Time to wake up.” Geraldine rang in a monotone. Samantha moved towards the source of the voice, and uttered weakly, “Who – who are you? What have you done to me?” “My – my dress?” “Yes dear, I need your dress. Kindly take it off, please.” Samantha curled into a ball. “Please… don’t… don’t hurt me!” “I won’t harm you if you do exactly as I say. Take off your dress, now.” Samantha wondered if he was being serious. “And… if I do… you’ll – you promise you won’t hurt me?” “He – here..” she delicately extended her dress. Now, wearing nothing more than her undergarments, she was beginning to feel more exposed to the cold air, and goosebumps were appearing all over her delicate skin. “Come on, Annabel, help us!” Annabel couldn’t take it anymore. She stormed out of the room and walked to the garden, where she saw Mother watering the roses. Everything in the garden looked so much more beautiful and appealing than what she was seeing in there. It was peaceful and sunny. A perfect distraction from- “-Anna… Annabel!” She turned around, and saw Gerald - (of all people!) running towards her. She was surprised; he even sounded like a girl now. And now he followed her here. He was clearly mocking her. “He’s not my sister, Mummy. He’s just being really silly. Everyone’s being silly. They think he’s a girl.” Mother still could barely control herself. “Geraldine!” She moved forward and picked him up in her arms. “From now on, your name shall be Geraldine.” “But Mummy!” she wailed. “It’s not fair! Boys aren’t supposed to play dress up like that!” Mother turned affectionately to her eldest. “Annabel, my dear… why can’t you just pretend like everybody else? He doesn’t mind!” To this, Gerald smiled in approval. Annabel couldn’t. There was no way. As long as Gerald was a… All her friends gasped at this suggestion. “But that’s even more wrong!” objected Daisy. “Mummy will be very cross!” “No!” Annabel insisted, “It’s perfect! It will really work!” “No he isn’t really. It’s just pretend,” responded Annabel. “But when we do this, we won’t have to pretend anymore.” Soon Annabel’s friends were all taken by this suggestion. A mischievous smile formed on each their faces. They were all planning to do something really naughty. “When shall we do it?” asked Wendy? “Let’s do it tomorrow morning!” said Daisy. And once they happily reached a decision, then all resolved to walk outside and accompany Gerald. They took him to the swings and slides. Now Annabel was happy. Lifting young Gerald onto the slide, Annabel began to push. “Soon Gerald, you really will be my little sister!” Annabel’s friends giggled mercilessly at this. Gerald laughed, still not knowing what was going on… “Umm… excuse me… excuse me… sir?” “What did you just say, dear?” “I…” she began, nervously “I’m just… so cold. I’d really like my dress back.” The man looked like he was beginning to calm down. “Yes… yes… your dress. You’d like your dress back. I’ll umm… I’ll get you-” He turned back and began to fumble around in a small wooden box. “Get you… get you your-” Then once he’d found what he was looking for, he turned around, and retrieved what appeared to be a whip. “WHAT DID YOU JUST CALL ME!?” Samantha shrieked, and curled into a ball. “Huh!?” Geraldine quizzed. “You think this is disgusting!? Well, aren’t you a delightful little thing!? I was looking forward to both of us revelling in our shared womanhood together!” Samantha could not hold it in any longer. She puked all over the cage floor. Geraldine rolled his eyes and began to lose his temper. “You are just like everybody else…” he spluttered “You…-You don’t know what it’s like… you live an ordinary life… you’ve never even thought to question what you were! In another life… in another universe… I could have been just as beautiful and insipid as you.” Then, pulling up his knickers, he thwacked the cage door in frustration. There was a loud clink noise. Samantha did her best to distance herself from the pile of sick. “Now…” he began. “First, you’re going to clean up that pile of sick, and then we’re going to try this again from the start.” He rummaged through his box and found an old tea towel and some Febreeze. “As soon as… as… as soon…” The old man started to feel faint. His face slurred, and half of his face appeared to lag as if it was no longer functioning. He looked as if he was having a stroke. “As… soon as we…” Then, he tumbled down and collapsed in front of the cage door, and after nearly a whole minute writing in helplessness, he passed out cold on the floor. Samantha noticed he was carrying what looked like a set of keys in his right hand. It was too far away for her arms to reach, so, carefully navigating around the pile of vomit, she reached out with her bare leg and clasped onto it. Success! “Shhh…” whispered Annabel. “Here he comes.” Gerald was waltzing proudly through the lounge. Then, he saw Annabel and smiled at her. “Gerald! Come here! Good boy!” Gerald ran as fast as he could. Annabel led her out to the garden and turned towards him. “Gerald… you can’t play with us as long as you’re a boy.” Gerald cheekily smiled with an oblivious look of excitement. “So…” Annabel smirked, “we’re going to turn you into a girl!” “From now on, your name shall be “Geraldine” Atkins!” At this moment, Mother came into the garden and witnessed everything. She was mortified, and absolutely speechless. She began to felt unwell, and noticeably unhinged by the nightmarish scene in front of her. She immediately ran towards Geraldine and inspected the damage up close… then turned with horror to see the innocent look on Annabel’s face, as she wiped away the blood on her face. 3-year-old Geraldine was taken to the local hospital, which did their best to repair the damage, though he fell into a coma, and did not awaken until 3 years later. Once the details of this incident became public, Penelope Atkins was deemed unfit to be a mother and lost custody of her children. She later committed suicide. Once he finally woke up, Geraldine was left in the care of his grandparents, who would scorn and reject him, seeing him as a nothing more than a “mistake”, who would never amount to anything. “Great Britain, Great Britain, Great Britain… On the parchment of history ‘tis written O, how our enemies shall soon be smitten Great Britain, Great Britain, Great Britain!” “Great Britain, Great Britain, Great Britain… On the parchment of history ‘tis written O, how our enemies shall soon be smitten Great Britain, Great Britain, Great Britain!”"}
{"url": "https://creepypasta.fandom.com/wiki/A_Barn_Raiding", "title": "A Barn Raiding", "author": "Unknown", "publication_date": null, "tags": ["Weird"], "content": "Serena stared at the sunset, allowing her eyes to soak up the pinks and the purples and the oranges, beholding the sight of the sun sinking below the horizon and turning the cornfield in front of her to fire. She shut her eyes, letting the rays kiss her eyelids as she breathed deeply and shifted her focus onto what she planned to do next. Without warning a loud sound suddenly boomed from behind Serena, making her jump out of her skin and whip around to maybe make a run for it. But as she looked back she saw Andrew desperately trying to turn down the volume of a small black speaker as the warbling sound of country music destroyed the once quiet ambience of the night. “You fucking idiot!” Serena hissed. She took a few furious steps toward him. “I thought it would be funny!” he hissed back, now fumbling to turn the thing off altogether and stuff it back into his bag. Serena was beside herself: “You were right.” Andrew breathed, “This was worth it.” He began taking photographs. “What are you doing? There won’t be enough light inside, and we agreed using flash wouldn’t be a good idea.” Andrew asked, face quizzical. “Oh right, I’ll come up with you.” Alas, behind her came the snapping of wood and a cry for help. “Quick, help me up!” he shouted. But to Serena, the sound seemed muted as if underwater. Her mind was racing. It was calculating there was no time to untangle his foot from the wire before they were caught. “Ser-Serena!” Her brain calculated the look of shock and disapproval he’d worn upon seeing her drugs. “Serena, help me up you BITCH!” Finally, she thought about the statement he’d give against her when questioned over trespassing. The noise of pursuit was becoming louder and louder. In her panic and fear, it was Serena’s brain’s turn to freeze. It couldn’t stop her body as her hand slid into her bag, past her drugs, camera, purse, and magazine, till her fingers curled around the handle of her gun. Shaking only slightly, she pulled out the firearm and pointed it. Andrew’s face twitched in surprise, twisted in confusion then contorted in fear. There came a bang and a flash. Andrew’s murderer turned and fled. Serena’s eyes fell upon the little plastic bags and the murder weapon. Even through her tears, she began to laugh."}
{"url": "https://creepypasta.fandom.com/wiki/A_Bag_of_Candy", "title": "A Bag of Candy", "author": "Shinigami.Eyes Originally uploa", "publication_date": null, "tags": ["Historical Archive", "Ghosts", "Places", "Shinigami.Eyes"], "content": "The building in which the theater is located. As a little girl, I was always fascinated by plays, musicals, and in general, the arts. Having a talent for acting early on, I didn't so much want to become famous as I wanted to entertain. Not only did I want to act, I wanted to know the workings of the whole shebang. Just as much as an actor remembering their lines, lighting was important, cues were important, and generally, forming the correct environment for pleasant viewing happened to be part of what I wanted to learn. The stage at my college was built long ago, and to be honest, I’m not quite sure when. It's located inside a place called \"Shilling Hall\" in the university I attended. I do recall mention of it being renovated in the 1953. It’s very old fashioned, though, and it is meant to host live performances. There are rows upon rows of seats and above it all is a huge balcony for other people to watch from. I've never seen the place packed, but I’m hoping the next time I act, it will be. There are all kinds of rumors that this place is haunted, but of course, I've never seen any evidence, and being the type of person I am, I won’t believe anything until I see it. Previously, I’d seen people going up onto the balcony and leaving a few pieces of candy on the rail for this “ghost”. I honestly think the cleanup crew would just pick it up and toss it, so it was a waste of time in my opinion. Now see, this “ghost” was described as a little brown haired girl, about seven is what most people guessed, with her hair cut into a bob. She wears a white dress with a pink tie around it. She is simply called “The Rail Girl” due to appearing near the balcony rail to those who have seen her. I didn't used to believe in her, but I certainly changed my mind after a few events. A friend and I were chatting over lunch one day, and he, being quite superstitious, believed in the paranormal. He was yammering on about why that girl might be there. Like she could havee been a victim of rape or murder and she was built into the walls, or she might’ have fallen from the balcony to her death. I rolled my eyes. I highly doubted there was a ghost at all, so I told him, quite simply. “Ryan, shut up and eat your sandwich,” and he proceeded to with a sheepish grin. He knew I didn’t believe him, but he always came to me with his harebrained ideas. Ryan and I were working together on the stage later. We were setting up for another play’s rehearsal. He left a few pieces of candy on the rail. I laughed to myself, viewing it as some sort of ritual sacrifice. As we were setting up, the fog machine started to run by itself. Ryan’s eyes bulged and he ran to turn it off. It wasn't even on. Furthermore, it wasn’t even plugged in. He decided that maybe three pieces weren’t enough and scurried over to leave her half the bag. Needless to say, I wasn't giggling anymore. “Can I help you?” She stared at me, swaying back and forth in her white dress. She gave me a simple answer. “No.” She vanished before my eyes. I was spooked. I didn't go there alone after that."}
{"url": "https://creepypasta.fandom.com/wiki/A_Baffled_Ambuscade", "title": "A Baffled Ambuscade", "author": "Unknown", "publication_date": null, "tags": ["AGB", "Military"], "content": "Story copied from the Wikisource . \"Where is your other man?\" said the major. \"I ordered Dunning to be here tonight.\" \"He rode forward, sir,\" the man replied. \"There was a little firing afterward, but it was a long way to the front.\" \"It was against orders and against sense for Dunning to do that,\" said the officer, obviously vexed. \"Why did he ride forward?\" \"Don't know, sir; he seemed mighty restless. Guess he was skeered.\""}
{"url": "https://creepypasta.fandom.com/wiki/A_Bad_Night", "title": "A Bad Night", "author": "Unknown", "publication_date": null, "tags": ["2015 Creepypasta Freestyle Challenge/Finals", "Science", "Disappearances", "3 more", "Videos", "Shadowswimmer77", "Crime"], "content": "Note: This story is an entry for the finals of the 2015 Creepypasta Freestyle Competition . For a full list of entries, see this category . Subject: Detective fired from his job “There's nothing more to be said. Your final check will be in the mail tomorrow. Molly and I thank you for your services.” Click The first Jack knew only by reputation, but the oily sheen that emitted from his too wide smile identified him as Graydon Marx. Jack's jaw dropped when he saw the people behind Marx were Chase and Molly Benson. Jack was just close enough to hear the end of their conversation. “...en can we see her, Mr. Marx?” “Oh presently, presently my dear, Chase. In fact that's where we're going now. Come along.” “What's the meaning of this, Marx? You said you were taking us to see our daughter!” “And so I have, Chase, so I have. She'll be here shortly. The fire, you see. We've found it draws them.” The millionaire smiled and moved to a tree at the edge of the clearing. In a smooth motion he hoisted himself up into a hunting platform set on the lower branches. “Ah, here she is now.” “Oh, my God! Baby!” Molly Benson threw herself at her child sweeping her up in a hug. Jack saw a look of ecstasy pass across the girl's face and a terrible hunger enter her eyes, as she suddenly opened her mouth and sank her teeth into her mother's neck. Molly screamed and Chase lunged for his wife as a fountain of blood erupted, washing June's face in gore. The girl rode her mother to the ground, worrying at the wound like a wild animal. Jack felt the world lurch. The Wicker Saga < Previous | Next > The Wicker Saga < Previous | Next > narrated by Carson Bobo narrated by Darkness Tales narrated by Nature's Temper narrated by Blue_Spooky narrated by Creepy Ghost Stories narrated by Natenator77 narrated by Gathering of Crows narrated by The Horror of Yig"}
{"url": "https://creepypasta.fandom.com/wiki/A_Bad_Kind_of_Idol", "title": "A Bad Kind of Idol", "author": "Unknown", "publication_date": null, "tags": ["Mental Illness", "Crime"], "content": "“It is a beast.” It wasn’t right. It wasn’t. We were being controlled by fear. We’re like prey, clueless and defenseless as we waited for the predator to come for us. We could try to seek help, but there’s no guarantee that help would come for us. After all, a predator makes sure that we’re cornered before he strikes. There was no chance of survival. As I came back to reality, I found myself staring blankly in space. I was seated there at the corner of the room, a place where I would be able to save myself from the usual classroom drama and a perfect spot for me to daydream where no one could interrupt me. The sudden change in the atmosphere in that four-cornered room was something that couldn’t be ignored. Everyone seemed to have left their own fantasy world and started to pay attention to that boy who was brave enough to open up a topic that no one dared to talk about. Mr. Hughes raised his brows, obviously taken aback by the boy’s question. Then a gentle smile crept on his wistful face. “Act of cleansing.” “Yes, Ms. Night is correct.” Mr. Hughes nodded. “It was believed to be an act of cleansing. Someone who has a very strong sense of righteousness may be driven to do such thing.” “I disagree, Ms. Johnson,” Mr. Hughes said. “We’re talking about a sociopath.” The girl arched a brow. “What’s the difference?” “We’ll continue this next meeting. See you.” He picked up his leather case and then strode out of the room. Following other students’ example, I stood up from my seat, picked up my things and joined the crowd. It’s time to go home. “Hey, Suzy, you know what Mr. Hughes was talking about, right?” Julia Johnson asked as she approached me. Julia Johnson’s short figure stood out in the crowd. Today she was wearing a pink dress to go with her single braid of dark hair. She’s such a darling. She’s always curious, always asking questions; but no answer ever satisfied her. I didn’t know whether she was just doing it to annoy people or she’s just really plain…curious. “Yes.” I stopped and waited for her to reach me. Then I smiled. “Jack the Ripper’s legend. It’s quite an interesting story.” “Tell me about him, please.” Julia’s wide brown eyes stared at me with a child’s curiosity. “We live on the same street, right? I’ll walk with you.” “Sure,” I replied. It was a surprise, to be honest. I didn’t expect her to go as far as walking home with me just to obtain information about Jack. Maybe it’s just me or maybe Hamilton’s question actually moved her. The distance from the school to my house was not that far, so walking was not much of a problem to me. The real problem was making it home safely. The sun was starting to set in the west horizon, painting the sky tangerine and purple. It was a beautiful sight. Everything was perfect; but beyond that false image was the fact that more people were going to die tonight. “Jack the Ripper was a legendary serial killer in England,” I told Julia. “And he mutilated prostitutes, right?” Julia asked. I nodded. “Uh-huh. He’s a high-functioning sociopath.” “Which means?” Julia’s brows knitted together in confusion. Julia’s expression soured. “Just like the serial killer in this town. We don’t know him. He’s just out there, waiting.” By that time, the sky was completely covered with darkness. Streetlights provided illumination, but they weren’t enough. Those things could not protect us from the beast. Darkness still surrounded us. There was no assurance. “This forest sure is creepy, no?” Julia said as we passed by the woods. Something moved in the darkness. I saw a horrendous sight, rendering my body frozen in response. This couldn’t be. “What’s wrong?” Julia stopped, her eyes widening. She must have sensed my sudden uneasiness. A lump formed in my throat. “It’s…him.” “Where?” Julia gasped. It was him. It was the town’s personification of Jack. The serial killer. It appeared right before my eyes. Yet…I never got a good look at his face. I couldn’t see his face. As quickly as he appeared, the killer left without any trace, taking his knife with him. Why didn’t he kill me? Why? Why let me witness this kind of horror? Just then, I heard myself scream. “What do I do?” I muttered, tears silently crawling down on my cheeks. “Ms. Night?” I looked up only to see Mr. Hughes walking up to my direction. As recognition registered on his face, he picked up his pace and ran to us. “What happened?” he asked, alarm evident in his voice. “Was it his doing?” Mr. Hughes asked, catching his breath. Why was he here? He lived in a completely opposite direction. Why was he here? Why was it like he’d run for miles just to get here? Did he know that the killer was after us? “Let’s call the police,” he said, offering his hand. I pushed myself up and backed away. Or could it be him? “Stay away from me!” I screamed, my voice coming out scratchy. “It’s you!” “What are you talking about?” Mr. Hughes stepped forward. “I’m here to help.” “It’s you…” I whispered. Just as he was about to jump on me, a patrol car came. The police officers quickly got off the car and drew their guns out, pointing them at Mr. Hughes. “Freeze!” said one of the officers. “Put your hands in the air.” Mr. Hughes did what he was told. Another officer approached him and inspected Mr. Hughes’ coat until he found something in one of the pockets. The officer held it up in the air. It was a knife. So I was right. It was him indeed. “You are under arrest,” the officer declared as he cuffed Mr. Hughes’ hands behind his back. “You’re coming with us.” “But-but I didn’t do anything! I can explain!” Mr. Hughes yelled, struggling as the officer led him to the car. Mr. Hughes looked at me like I did something wrong. It was like he just realized something. His eyes were wide with horror, but he didn’t say anything. “As for you,” said the other officer, pointing at me. “We’ll take you to your house and talk to your parents.” I swallowed and nodded. That mousy Mr. Hughes was gone now. No more threats. I threw the bloody knife into the sink and stepped into the shower."}
{"url": "https://creepypasta.fandom.com/wiki/A_Baby_Tramp", "title": "A Baby Tramp", "author": "Unknown", "publication_date": null, "tags": ["AGB", "Ghosts"], "content": "A Baby Tramp (1893) by Ambrose Bierce Story copied from the Wikisource . Below, a Spoken Word Version. https://creepypasta.fandom.com/wiki/File:LibriVox_-_A_Baby_Tramp.ogg Jo ran away from the Infants' Sheltering Home at Whiteville -- just took to the woods one day, and the Home knew him no more for ever. Jo did not."}
{"url": "https://creepypasta.fandom.com/wiki/A_Baby%27s_Soft_Spot", "title": "A Baby%27s Soft Spot", "author": "Pacersnation", "publication_date": null, "tags": ["NSFW", "Mental Illness", "Pacersnation16"], "content": "I sluggishly meandered my way down the creaky hall that led to my parents’ room. After paying the routine visit to my brother, I stretched my limbs into the crack in their doorway. Making as little sound as possible, I entered their bedroom. Filled with the echoing sounds of my father's yawning, I stood before their bed. I held an unbroken gaze at them now while I held my hammer in hand. The same hammer I cracked my brother's skull with now lay inches behind my father's skull. Just as before, I slowly pulled my arm back. I locked it in position, grasped it firmly, and pushed it forward with full throttle."}
{"url": "https://creepypasta.fandom.com/wiki/A_911_Call_Where_Nothing_Made_Sense", "title": "A 911 Call Where Nothing Made Sense", "author": "Unknown", "publication_date": null, "tags": ["Reddit Pastas", "Beings", "Crime", "2 more", "Mental Illness", "Videos"], "content": "We decide not to say anything about this as we tell Carol that we came up with nothing. However, she tells us to stay. “I recorded him,” she says. We get out of the car and make our way over there, knocking hard on the front door. However, nobody answers. We can see lights flicking on and off intermittently, but we’re not sure what that’s supposed to mean. Was she trying to tell us to leave? We get a call from dispatch a few moments later. They’re telling us that Carol has called 911 again, saying that there are now multiple people in her house. They ask if we need backup. We say yes. As I pace around in petrified confusion, Beck speaks up: “There’s rooms here that shouldn’t be.” “What the hell are you talking about?” I ask in response. “I’ve been counting,” he says. “There were 9 total the last time we came. There are 10 now. You didn’t notice it?” I force myself to think hard. Subconsciously, I knew that something was off, but couldn’t pinpoint exactly what. However, I eventually realize. “The basement. There was only one door down there last time.” Beck nods. “Two now.” We hear a knock on the door about 10 seconds later. It sounds agitated. We look out the living room windows, but aren’t met with the red and blue police lights. We’re hesitant to answer, of course. I decide to take a step forwards, but Beck pulls me back. “Did you find him?” she asks, without any semblance of emotion in her voice. “I think he might be in the basement. Why don’t you go check?” Beck and I are frozen in shock. She just keeps looking at us, gesturing towards the basement door every now and then. The footsteps down there sound like they’re running in circles now. We ignore her request, abruptly brushing past her and bolting out of the front door. The backup still isn’t here, so we decide to just get into our car. However… we see somebody down the street peering through our driver-side window. He’s large, dressed in what appears to be a black full-body suit. He looks away from the window and directly at us. It’s hard to tell from this far, but the suit doesn’t seem to have any eye-holes. Beck speaks up: “Sir, please step back from the vehicle.” His voice cracks in the middle of the sentence. He’s terrified. As soon as Beck stops talking, the figure starts running towards us. It’s fast. Too fast. In the time that it takes for us to pull up our guns, we’ve realized that it’s actually moved past us, into the house. We waste no more time, running into the car, locking the doors and waiting until backup arrives. I don’t know how he expects us to do that. We drive back to the station in complete silence. As we park, Beck finally lets out a sigh. “Jack is fucking crazy, dude.” I look at him in confusion. “What are you talking about? Who the hell is Jack?” He reciprocates an equally confused stare at me. “What the hell are you talking about? The dude who owns the house.” “We need you. A woman dialed 911. Says that somebody’s in her house.” I hang up the phone and slump into the bed. I just want this nightmare to end. Credited to Mr_Outlaw_"}
{"url": "https://creepypasta.fandom.com/wiki/AND_THEN_A_SKELETON_POPPED_OUT", "title": "AND THEN A SKELETON POPPED OUT", "author": "Unknown", "publication_date": null, "tags": ["Historical Archive", "Troll Pasta", "Memes", "2 more", "Micropasta", "Contextual"], "content": "Like other classics such as WHO WAS PHONE? and TEH DAY OF ALL TEH BLOD , this is a legendary troll pasta, an all-caps jewel in the community. The phrase \"AND THEN A SKELETON POPPED OUT\" is often used to point out that the ending of a creepypasta is predictable or just downright shitty. It is also a dedicated category on the Trollpasta Wiki . This is the skeleton that popped out. Original author unknown"}
{"url": "https://creepypasta.fandom.com/wiki/AC-130U_%22Scorpio%22_Log_Two", "title": "AC-130U %22Scorpio%22 Log Two", "author": "Unknown", "publication_date": null, "tags": ["Military", "Diary/Journal"], "content": "This is the log of AC-130U 06. Recording action and events during Operation Cleanup. I have been informed that I cannot record any information or personal opinions of the events that occurred January 14th, 2017 at 2100 hours. I am permitted to record private notes to myself in my personal journal so long as they are kept off the log. I am required to record that new crew have been chosen for the operation and I am to record their names, duties, and designations. 1. Halberd, James T. : Captain, operation control and supervisor. 4. Haim, Byron F. : Technical Sergeant, Pilot. 5. Jacobs, William T. : Senior Airman, Pilot. 6. Wilcox, Jacob Y. : Airman First Class, 125mm Gunner. 7. Hanson, Jeffrey M. : Airman First Class, 40mm Gunner. 8. Weaver, Jason R. : Airman First Class, 25mm Gunner. 9. Maxon, Eric K. : Airman, Standby, 10. Crater, Jonathan D. : Airman, Standby. 11. Rainer, Chris H. : Airman First Class, Logger. 12. Rimmer, Harold K. : Staff Sergeant, Communications. 12:45 : Communications are haywire. Situation has gotten worse. Delta has been deployed inside the city. 13:30 : Escort Helos around AC-130U 06 Scorpio. To \"prevent\" a down. 13:35 : Arrived at Target Zone. Beginning sweep of perimeter. 13:50 : Clearing...Potentially hostile civilian helicopter, looks to be media. Waiting for orders. 13:55 : Command wants us to engage civilian chopper...quickly reverses decision. Command plans to fire ground missiles at chopper under guise of hostile OpFor with Platoon 05. 14:00 : Chopper brought down. Command orders us to fire on Platoon 05. 40mm cannon fired, all targets eliminated. 14:40 : Recon reports Team One is investigating. Team one breaks comms. Demands to know why high-power rounds hit the ground. Command reports as misses on the Chopper. Makes imperative that Team One has disobeyed orders and breached perimeter. Orders AC-130U 06 to keep watch. 14:45 : Team One hits communications again. Reports that evidently, Chopper was Civilian Media and brought down with a handheld RPG. AH-1 017 fires weapons at AC-130U 06. AC-130U 06 sustains damages and deploys flares to divert rockets fired. Command orders AC-130U 06 and AH-64's 014, 056, and 005 to fire upon Team One. 14:46 : AC-130U Sustains further damages from ground-to-air fire. Integrity at 75% percent, returning fire. One engine down, still able to operate on remaining three. (Personal Note: This is shit...the shit...) (Personal Note: Can hear men on the comms screaming. About their legs...their bodies...crying for their mothers...crying out to God...screaming...others yelling at each other to move, and I can hear the shells hit in the background. I can't keep doing this.) 15:00 : All targets eliminated. Comms open up again, but silence. Team One's commander informs us that we are doing the wrong thing here. Command jams signal and breaks Comms. Orders AC-130U 06 to move back to perimeter breach where the infected crowds and OpFor are running. 15:05 : OpFor have engaged both infected and troops from Team Two at Fifth Perimeter. Three-way attack, the infected crowds are large. Firing 25mm's at Infected and OpFor to reduce risk of hitting Team Two until Command informs us to do otherwise. (Personal Note: Even if they did, Fuck them. I'm not doing this again. FUCK IT. FUCK IT.) 15:10 : OpFor have breached security perimeter and Infected are pouring out. (Personal Note: we're all thinking the same thing here. Are we going to have a repeat again?\" 15:14 : Wilcox fires 125mm rounds down at the ground. Crew offers no response. Pilots circle around to make second pass. Team Two survivors screaming that they are taking \"Friendly Fire\" from \"Our birds in the air.\" 15:15 : mass of threats eliminated, scattered forces still outlying. switching to 25mm. 15:23 : All targets eliminated, Second group of hostiles reaching fourth Perimeter. Focusing with AH-64's. Targets engaged. 15:25 : Targets eliminated effectively with 125mm. Remainder of targets eliminated with 25mm Equalizer. (Personal Note: It never gets old, and you never get used to it.) 15:30 : Command orders all ground forces to pull back from the gate, and engages new procedures. Orders AC-130U 06 to remain on standby and carry out original orders until new orders are issued. (Personal Note: just...Captain's starting to piss me off. He really can't keep his mouth shut about what's going on. He's trying to tell us we're doing the right thing, we're not. We're getting paid. That's why we're here. We're getting paid, and we're being threatened with death if we don't.) 15:45 : AC-130U 06 circles around Third Perimeter again. Still on standby. 15:50 : Small group of infected spotted leaving first perimeter. AFC Hanson is uneasy and fires before they leave first perimeter. AFC Hanson is reprimanded by Captain Halberd for this. Officers still debating whether to report him to Command. AM Maxon takes over for Hanson. 15:55 : Hanson uneasy and is beginning to become irate. Cpt. Halberd makes note. (Personal Note: I'm getting sick of this. There's just nobody who can do this. I'd put Halberd on the gun and see if he can, Then again, I'm an airman enlistee and therefore am not entitled to have such opinions. Fuck that.) 16:05 : Hanson attempts to convince other crew to turn against Captain Halberd and Command. Attempts to convince that this is wrong and that we need to stop. Captain Halberd determines Hanson is an immediate threat to crew and has him restrained. Command is notified. (Personal Note: This isn't protocol. This is bullshit. They want to keep us in the air, but they don't want to deal with this either. They) 16:20 : Captain Halberd discharges his sidearm into Airman First Class Jeffrey M. Hanson. Hanson's cerebrum is destroyed by a single shot and is pronounced KIA. Captain Halberd informs the crew that he, as commanding officer of the crew, has permission by command to do this, and he informs us that he is Intelligence assigned because of the actions of last night. Captain Halberd orders us to open the bay door. Obliged. 16:21 : Hanson is disposed of by being tossed out the bay. We are told not to speak of this event. (Personal Note: Moriarty grows uneasy. speaks to me at a whisper that we need to get rid of Halberd. I inform him we will be in world of shit if we do. He explains that if we keep it quiet, then we explain Halberd committed suicide after elimination of Hanson due to emotional guilt. We throw his body out at the the order of Moriarty, and thus First Lieutenant Moriarty takes command. I...agree. But I inform him the action will have to be logged, whatever he does. We will need to make up for time. He orders Rimmer to cut comms and he will tell me what to log.) 16:38 : Bay doors open and Captain Halberd's body is summarily disposed of. Making rounds again. Standby. 17:35 : Rimmer is restrained by crew members and eliminated by First Lieutenant Moriarty. Command is informed. We are told by Command that the operation will follow different procedures which will be listed when we return to base. AC-130U 06 is ordered to return to base immediately. 18:30 : AC-130U 06 lands safely at base."}
{"url": "https://creepypasta.fandom.com/wiki/AC-130U_%22Scorpio%22_Log_Three", "title": "AC-130U %22Scorpio%22 Log Three", "author": "Unknown", "publication_date": null, "tags": ["Military", "Diary/Journal", "Cryptids"], "content": "The AC-130U This is the log of AC-130U 06 \"Scorpio\". Complete overhaul because of what happened with Team One. We are renaming the mission \"Operation Sterilization\" rather than \"Cleanup\". According to them, Cleanup seemed more colloquial and casual, or at least, that's what they told us. Sterilization was more direct, more formal sounding. It was the original name for the operators going in, and as far as we know, Seal Team Three's troops were slaughtered, fireteams scattered and broken up, and they've sent in the Marines in a direct engagement operation. The mission still remains the same, we watch the perimeter and keep infected inside the quarantine zone. I have begun to question this mission in the first three days. I've seen a lot...and done a lot...Shit ain't right. 12:30 : Leaving the runway. One more time. 13:00 : Nothing as of yet. Comms are coming on now, we're getting warned that the place is going to be a blitz when we arrive. Hordes of infected are reaching the third perimeter and the Gunships on patrol currently are running dry, so are the AH's. 13:33 : Firing at gate with 40mm to eliminate large groups of infected moving through the gate. Gate has allowed the narrow the wide formation of infected, making it easier to target and wipe out with the 40mm. Ground runs red with blood and guts. Quite a sight. 13:35 : Infected still breaching. Team Two is able to hold their ground with help from AH-64s. Luckily no special infected encountered. Command breaks line. Informs AC-130U 06 to get \"our asses in gear\" and eliminate the formation. 13:47 : Eric Maxon reports the 40mm gun has jammed. Crew Chief 2nd Lt. Peters is assisting him. We're without 40mm. We're firing the 125mm. But we don't have the \"inbetween\" for smaller groups. We can't waste howitzer ammunition on smaller groups of infected. 14:30 : Moriarty warns the crew that we may have to re-arm. I now see what Forward Command was talking about. The other gunship, AC-130U 03 is running dry as well. 14:35 : Estimated 1200+ Infected KIA. Looks be last horde of infected arriving, Est. 300+ infected. We can do this. Team Two informs me they're barely holding. They have lost a fifteenth of their unit. This is not good. 14:40 : Ran out of 125mm Howitzer shells. On last two packs for 40mm BOFORS cannon. Est. 125+ infected left, reaching fifth perimeter now. 14:55 : On approach to Firebase Alpha Strip. Control tells us to get back out quickly. Something's wrong. Firebase Alpha is warning us that some kind of very powerful giant infected is reaching the area. First line of defenses lost and are retreating. 15:53 : 125mm howitzer and 40mm BOFORS fired directly at creature. Knockback power is incredible, damage is visibly dealt to creature. Creature is large, at least seven meters tall. Humanoid, muscular. A pale salmon red. Yellowed eyes. Pulsing muscles visible, as well as large pulsating carbuncles and papules emanating blood and white liquid, most likely pus. Visible wound from shells, 125mm took off creature's arm. Blood is a dark yellow color. Creature is getting back up. 15:55 : Another round was fired, creature successfully dispatched. Damage assessment underway, Command urges control to get us re-armed to patrol again. Control and Command at disagreement right now. 16:00 : being refueled and re-armed. 16:20 : In the air again. 16:30 : Distress signal from surviving SEAL TEAM THREE, Troop One, Platoon 1 sent out. Confirmed Five SEALs from Platoon 1 survived. Platoon Two dispatched to provide aid. New orders issued to SEAL Platoon 1 and 2. These orders are not heard over Communications. 17:00 : It's been quiet. Moriarty warns that this isn't a good sign. 17:30 : All clear. Communications cut on. SEAL Platoon 1 and 2 are encountering heavy resistance, including a creature matching the description of the one faced at Firebase Alpha. Moriarty requests permission from Command to engage and provide air support. Command does not answer. 17:33 : Command denies request to provide support. No other air support will be dispatched as well. Moriarty makes request again. Command refuses due to executive orders. 17:35 : Comms open up again. SEAL platoons are down to thirteen men altogether. Requests immediate assistance. Command denies. FUCK COMMAND. THE SEALS NEED OUR FUCKING HELP. 17:50 : hit by RPG. Losing altitude but stable now. Something just hit the tail of the craft. Second RPG hit. Creature is confirmed crippled but still alive. 17:53 : SEALs confirm all targets eliminated. Multiple sustained damages, but still in the air. Unidentified humanoid creature breaks into craft, HULL BREACH. FU-- I've been tasked with carrying the log, but recording further information within LTJG Hudson's Journal. No point in writing two logs. This is AC-130U 06 Scorpio's Crew's last official log during Operation Sterilization. AFC Rainer, Chris H."}
{"url": "https://creepypasta.fandom.com/wiki/AC-130U_%22Scorpio%22_Log_One", "title": "AC-130U %22Scorpio%22 Log One", "author": "Scorch", "publication_date": null, "tags": ["Military", "Diary/Journal"], "content": "This the log of Scorpio, AC-130U 06. Recording action and events during Codename: Operation Cleanup. The objective of this mission is to quarantine the infected zone, and our job as gunship AC-130H 06 Codename: Scorpio is to eliminate any potential infected leaving the quarantine zone until an effective course of action can be taken by the government. AC-130U Scorpio from the eyes of the leaving gunship. 01/14/2017. 13:40 : We have reached target zone. Smoke reaches the sky, distracting to pilots. Making it clear to pilots that our mission is to secure the perimeter, not the quarantine zone. 13:50 : Beginning perimeter control for the 24-hour period until AC-130U 04 enters airspace. AH-64 \"Apache\" helicopters patrol the inner city, Recon P-8 \"Poseidons\" from the Navy are reporting what's going on down there. (Personal note: Our work is cut out for us. We hardly have to do anything except shoot where they tell us to.) 14:00 : First potential target spotted. Identified from a closer view as a young male. Carrying backpack. Unarmed. Running fast. (Personal note: Good shot. Then again, we're firing 50 rounds a second.) 14:14 : Target eliminated. (Personal note. Target was quite gruesomely executed, split in half by multiple rounds. It's amazing to see what 150 25mm rounds can do to a person.) 14:30 : Warning has gone out via vehicle convoy that people are not permitted to leave Quarantine zone and should return to their homes until the Government can provide aid. (Personal note: Who are we bullshitting? We're going to go in and wipe them out anyway. At least I get paid enough to live with this.) 14:46 : Infected targets ambush both the hostile OpFor and friendly force. Still requesting permission from Command to engage. (Personal Note: I can't watch this. Even if it's hostiles they're killing, people, I don't care. You never get used to it.) 14:47 : Permission finally accepted, but told to efficiently use M102 Howitzer to neutralize the entire area. We will be firing on our own men down there. 14:48 : All targets, friendly or hostile, eliminated. 15:00 : Still circling perimeter. Things have quieted down around the perimeter, but Comms are saying that the city is a war zone right now. 15:30 : No important action as of yet. Command encourages that we keep logging even if nothing important has happened. (Personal Note: I don't see why.) 16:26 : Target eliminated. Clear kill. 16:45 : Convoy of armed hostile targets leaving quarantine zone, but are circling first perimeter. Permission to engage denied. 17:00 : Over comms, AH-64 021 appears to be uneasy about situation, requests permission to engage. Permission denied. 17:30 : Hostile Convoy stops at the edge of the first perimeter. Inactive. (Personal note: They're hostile, they're armed. And yet fucking rules of engagement in the way. We're going to get hit. I know it.) 17:42 : Command responds finally, and still does not clear us as we have not been fired upon and they have not yet left the first perimeter. Requests video feed of \"alleged stinger missiles\". AH-64 011 is hit by stinger. Going down. Command allows us to engage. 17:44 : Two out of six hostile vehicles destroyed. AH-64 011 is taking fire from an armed pickup truck. 40mm cannons fire upon truck. AH-64 011 does not respond. 17:45 : Five out of six hostile vehicles destroyed, two targets on foot. AH-64 021 takes hit and goes down. AH-1 004 takes out two foot targets, AH-64 030 destroys final vehicle target. (Personal note. Person at other end at command should be considered for disciplinary action. Personal note: That person can go fuck themselves.) 19:00 : Been time since last log. Logger apologizes for distance between logs, dispute settled between crew. Nothing to be worried about. 19:30 : Nothing as of yet. 19:35 : Scattered infected leaving city limits. Appear to be migrating. Confirmed infected. Waiting for okay to engage. 19:40 : Targets leave first perimeter, command clears to engage. 25mm minigun used on Infected. works effectively. All targets eliminated. 20:30 : Nothing as of yet. Crew is somewhat distracting but not at a disrupting or diverting level. (Personal note: Fuck... no... not this.) 21:00 : Crew returns to duties, identifies targets leaving first perimeter. (Personal note. Shouldn't have come... fuck... no...) 21:02 : Command gets feed. Permission to engage when targets reach the first perimeter. Crew, especially 25mm gunner appears to be weary and disturbed. Reminded of duties and mission. 21:03 : Targets reach perimeter. Still going. Command gives okay to engage with 25mm cannon. Gunner refuses to. (Personal note. Can't blame him, but we've got a job. Command's going to bitch about this... he could lose his job... court-martialed, jailed... or worse.) 21:05 : Command reminds First Lieutenant William F. Davidson of his duties and the reprimands he may face. He tells us this is wrong and that we can't do this. Command privately tells me to ensure the targets are eliminated. 21:16 : Still no movement. Infant is immobile. Movement from infant. Gunner takes shot. 21:30 : Command reprimands crew and demands that we carry out orders and return to base for debriefing. Crew is urged never to speak of this event again. 21:50 : Making final rounds. 22:00 : Returning to base as AC-130U 04 arrives at the perimeter."}
{"url": "https://creepypasta.fandom.com/wiki/A.P.D.", "title": "A.P.D.", "author": "Unknown", "publication_date": null, "tags": ["Reality", "Science", "Diary/Journal"], "content": "A.P.D. Airborne Pandemic Disease I-S-L in Final Stage: Infectivity Level: 90% Severity Level: 100% Lethality Level: 100% Disease Type: Prion Test Subjects: Survived: Deceased: [DATA HIDDEN] Below are the following stages, times, and I-S-L levels of the disease. Stage 1: Only Warning Symptoms: Severe Coughing Time: Infection Begins I-S-L Infectivity: 5% Severity: 5% Lethality: 0% Stage 2: Post-Warning Description: If you hit this stage, it is almost too late to save yourself from becoming a vector of transmission. Symptoms: Severe Sneezing Pneumonia Nausea Insomnia Time: 5 minutes Post-Infection I-S-L Infectivity: 25% Severity: 10% Lethality: 5% Stage 3: Internal Hell Description: At this point, killing yourself or getting yourself killed will be no help. Symptoms: Immune Suppression Necrosis Paranoia Seizures Inflammation Pulmonary Fibrosis Vomiting Diarrhoea Time: 12 hours Post-Infection I-S-L Infectivity: 50% Severity: 65% Lethality: 45% Stage 4: Death Point Description: Surviving beyond this point is next to impossible. Symptoms: Dysentery Insanity Hemorrhagic Shock Internal Haemorrhaging Tumours Systemic Infection paralysis Hyper Sensitivity Possible Coma Time: 24 hours Post-Infection I-S-L Infectivity: 90% Severity: 95% Lethality: 95% Stage 5: Judgement Hour Description: Anybody who lived to this point would be considered the unluckiest of them all. Maciash stated \"The way the organs failed was so rough and so quick that it was inhuman. I was scared to ask if this was a disease... or something else...\" Symptoms: Immediate Full-Body Total Organ Failure. Time: 48 hours Post-Infection. All infected humans will not survive past this stage. I-S-L Infectivity: 90% Severity: 100% Lethality: 100%"}
{"url": "https://creepypasta.fandom.com/wiki/A,_B,_C,_D", "title": "A, B, C, D", "author": "the stairs", "publication_date": null, "tags": ["Mental Illness"], "content": "I walked over to the basement door and opened it, looking down into the black abyss with which I was very familiar with. I push my blonde hair out of my eyes so I can see the steps carefully, making sure I don’t trip. “I used to ride that horse like there was no tomorrow! Did you see the picture of me on it when I was a baby? It’s on the mantle. I’ll show it to you later.\" I walked past the shelves of unstuffed teddy bears and moved towards the piles of clothes. “As you may have noticed my mother is a hoarder. I don’t think she has thrown anything out that I’ve ever used. She’s kept every toy, every shoe, every item of clothing… I’m surprised there isn't a mountain of used tissues that we have to climb over!” I pushed through the piles of red and black clothing from my childhood. Only red and black. I never wore any other colors. They just didn’t suit me like red and black did. But red was my favorite. Most of my dolls used to wear red dresses. The teddy bears would wear red ribbons. And I would wear red outfits to match. It was just such a bright, intoxicating color. I stopped in front of the rack that held my clothes from middle school. I pushed a few aside until I found the outfit I was looking for. It was a sleeveless, red dress with black polka dots all over it. Around the middle was a silk, black ribbon that tied in the back. I pulled it off the hanger and hung it in the air. “Do you remember the day we first met? It was three years ago today, the first day of school. My first day of public school. I didn’t know a soul. And then I saw you. You were wearing a blue button down shirt and pair of khaki pants. You looked so handsome.” I stopped at the box marked with a red “P”. I pulled it out from beneath the other boxes marked with 18 other red letters. I picked it up and moved farther down into the basement. “Every other girl in the class thought you were handsome. You were such a pretty boy, Patrick. Pretty Patrick is what they called you. They said if you wore a dress you could have easily been a girl. No. You were too handsome to be a girl.” The dirt beneath my feet became moister as I dug farther into the earth. The hardened soil soon broke way to softened mud, much easier to dig up. Much easier to get to what I wanted. “Good night Patrick. See you next year.”"}
{"url": "https://creepypasta.fandom.com/wiki/Local_Sitemap", "title": "Local Sitemap", "author": "Unknown", "publication_date": null, "tags": [], "content": ""}
{"url": "https://creepypasta.fandom.com/wiki/A_Paradise_Lost", "title": "A Paradise Lost", "author": "Unknown", "publication_date": null, "tags": ["Diary/Journal", "Space", "Nature", "Lovecraftian"], "content": "1 Entry 1 2 Entry 2 3 Entry 3 4 Entry 4 5 Entry 5 6 Entry 6 7 Entry 7 8 Entry 8 9 Entry 9 10 Entry 10 11 Entry 11 I’ve decided to begin keeping a journal on the progress of the colony. I don’t know why, I suppose I just want a place to compile all my thoughts. Unfortunately, the trip has been uneventful so far. The wilderness has been more of the same, large titanic forests surrounded by lush undergrowth. The cool, sticky air clung to our jumpsuits while we traversed through the planets landscape. This planet feels so similar, yet alien. Untouched by society, I wonder if earth once looked like this? We stumbled across a pond towards the end of the day, it was a murky colour with algae and several fallen branches floating on it. On the opposite end of the pond stood a large creature drinking the water, similar in shape to a deer, though its fur was a deep black and its antlers held more resemblance to a goat’s horns than a deer’s antlers. It was mesmerizing. It raises a question though, if there are prey, how come we haven’t come across any predators? The others have fallen asleep, were going to continue exploring in the morning. I’m going to try and get some shuteye. Ill report our findings next time I get a chance. Strange findings. Early in the morning we came across an odd sight. We came across a rather large waterfall, a brilliant blue colour. The rushing water sparkled with life. A couple meters away from the waterfall stood a sight which stopped all of us in our tracks. There was a campsite. There was a campsite. The rest of the day passed without incident, for the most part. Halfway through the day, I started catching whiffs of a strange scent. It was sickeningly sweet, combined with the smell of rotten fish. It was incredibly pungent and only grew stronger as the day went on. Its dusk now as I write this, the air is unpleasantly warm. I keep thinking back to that campsite, what was it doing there, and what happened to its occupants? I must’ve fallen asleep last night because when I woke up Fritz was gone. We looked for hours but we couldn’t find him. We couldn’t even find footprints. I’ll report back by the end of the day. On the way back, we stopped at the campsite. The colonists that stayed behind were gone. But I hardly noticed due to the change in the landscape. The waterfall was murky, green and bubbling. A far cry from the beautiful cataract that it once was. The air felt oppressive and polluted, the feeling was only strengthened by the pungent stench that now completely enveloped my senses. Everyone was anxious to go, but I wanted to check the place out further. I was investigating one of the sleeping bags when I noticed it. It was a small fissure in the earth, roots and vines sprawled out of it. I put my face closer to it, inches away from the crack in the coarse ground. After a moment of scrutinizing the crevice I noticed something. Deep inside the fissure a face stared at me. Yeah, a goddamn face. The worst part is that I recognized her. Maya, I believe her name was. Roots intertwined with her rough, dirty face. She attempted to cry out, but the roots appeared to be strangling her, dragging her into the depths. We’ve set up camp a few miles out from the site. It’ll be a day’s walk to get back to the colony in the morning. The smell is absolutely overpowering me now, I don’t know how the others have gotten any sleep at all. We started this journey with 12 people, now we have 5. Ill report my findings next time I get a chance. I saw it happen this time. It was very late last night when it happened. I was leaning against a nearby tree when I saw a fissure erupt from the ground near Gerald. Roots slowly crept from the crevice, making their way towards him. The roots surrounded Gerald, tightening around him. His eyes flipped open, but it was too late for him. The roots violently brought him back into the hole, thrashing against his weight. I snapped myself out of the daze I was in and sprang into action. I tried to hold onto him, but the roots tore him away from my grasp. I cried out, waking the others up. There was panic, screaming and all the while we struggled against the roots in an attempt to save Gerald’s life. The roots overpowered us, dragging him into the fissure before promptly closing up. We’ve decided not to rest again until we reach the colony. I’ll update the journal once we reach home. Hopefully I have some good news for a change. I’ve found this planet to be exceedingly cruel. It was dusk when we reached the colony. Lisa wanted to stay here to try and get the ship working. Everyone else wanted to try our luck in the wilds, that place wasn’t safe. Unfortunately, we couldn’t convince her to come with us. Its sunrise now, we’ve been trudging through this planet nonstop for several hours. We’re taking a break for a few moments so I’m using the opportunity to write this entry. Well that could’ve gone better. The idea was that we would sleep in the branches of a tree for the night. Our logic was that it can’t get us if were up high enough. I was assigned with keeping watch for the first half of the night. Things were fine until a few hours into my shift, when I was having trouble maintaining consciousness. It was 1:37 AM when I finally succumbed to my need for sleep. I woke up to Sasha pushing me awake, her eyes were wide, and she looked like she was on the verge of tears. She pointed towards the end of the branch where Paul was sitting, that’s when I saw it. A branch was sticking out of his mouth. It must’ve been growing throughout all his body, he writhed in agony, trying to scream, trying to be heard. We decided to end his suffering. The sound of the shot rang out for miles. I watched as the branch in his body slowly withered away, his body returned to flesh and he dropped from the tree with a sickening crunch. We decided to burn him, I don’t trust this planet enough for a proper burial. Me and Sasha both decided to avoid trees from now on. I never liked Paul that much, but I still feel a strong sense of loss. He was one of the few people left on this godforsaken planet. I wonder what happened to the others? What does this place need us for? I discovered something odd today. I brought the flaming stick towards a tree, it seemingly shriveled up the closer the flame got. The moment my makeshift torch hit the tree it ignited like it was doused in gasoline. Until I heard the roar. I shouted at Sasha for the gun as I slowly backed away. I don’t know what happened, we packed up immediately. We traveled for a few hours before finding a place to rest again. Fear the earth lest it devour you whole, fear the trees for they hold secrets that you’ll never know. I’m all alone now. I don’t know if it was because of the loneliness, the fear, the knowledge that our rations are running low, or just the tiredness. But I guess she couldn’t take it anymore. I decided to burn her body. She wouldn’t have wanted it to be taken. We never talked much, even when it was just the two of us, but I felt close to her. I thought about joining her, but I don’t really see the point. Maybe I’ll be rescued eventually and get off this horrible planet. But until then, I’ve decided to keep going This planet is getting restless, I can feel it, and I don’t know how much longer it’s going to wait. I’m so tired. I haven’t slept in days and I’m out of supplies. The water is poison. The plants are inedible. The meat of any animals I manage to kill rot within seconds. I think I’ve figured out why this place doesn’t have any predators. It’s because this place IS a predator. It lures people like us in with its bountiful resources and lush landscape, and when our guard is down, it goes in for the kill. I hate this place. My only hope is that someone finds this journal and gets out before it’s too late. At this point, I just want to know what awaits me deep below the ground. Will it just eat me? Or is there something more? I found a nice spot to lie down for a while. I wonder if I’ll see the others when I’m down there?"}
{"url": "https://creepypasta.fandom.com/wiki/A_Painterly_Manifesto", "title": "A Painterly Manifesto", "author": "the logic that things are chaot", "publication_date": null, "tags": ["Mental Illness", "Diary/Journal", "William See"], "content": "It’s never been my place to say who deserves better or who deserves worse in this world. Despite my failures, my successes, and everything in between, I always found myself functioning by the logic that things are chaotic and chance-based no matter how hard we try to deny it. Human suffering is an art form. The human body is a paint brush. True change occurs in the world when enough pain is reached that a threshold between the ideological and the physical world can be broken. Therefore, my work is an exploration into the changing of the landscape using that pain. As an artist, I am subject to the laws of my own changes; let suffering paint my being, and let my ideas contort the mind. Is that not the very point of art? To break, to remake; to move, and be moved; to feel, and be felt! Yes! Why, in this god forsaken, evil and wretched world, have we forgotten such a crucial and fundamental truth to the arts? Mark my words. They'll know real art. They WILL know it by the time I've turned to dust. It doesn’t matter. None of it will matter."}
{"url": "https://creepypasta.fandom.com/wiki/A_Painter_From_Queens", "title": "A Painter From Queens", "author": "Unknown", "publication_date": null, "tags": ["Historical Archive", "Items/Objects", "Weird"], "content": "There's a bum that lives in our neighborhood in Queens. He used to beg for change, but one day he started painting. He started painting on whatever garbage he could find: cardboard, paper, or whatever provided a flat surface. And he was really good, too. It was weird. He did landscapes, paintings of the places in the neighborhood, dogs, and some cool looking fantasy stuff. This guy was the damn Michelangelo of bums. He'd sell them for fifty cents or a buck. Then he'd use the money to buy some booze and drink himself into a coma. You know, a typical artist. The note simply said, \"Good luck.\" He said it as he was passing and continued to walk on, but not before I got a glimpse of him. He was twisted and misshapen. He walked with a distorted gait. Crows and bugs trailed him, feeding on him. I looked around. Everyone and everything looked the way I did in the painting now. Everything I see makes my eyes water. Everything is horrible and ugly. Everyone tells me how beautiful my portrait is, and no matter what I do, I can't convince them that they shouldn't get one themselves. Original author unknown"}
{"url": "https://creepypasta.fandom.com/wiki/A_Painted_Christmas", "title": "A Painted Christmas", "author": "mere miles", "publication_date": null, "tags": ["Christmas", "Beings", "Places", "Historical Archive"], "content": "Patrick Finn arrived home from his Christmas conquests, beating out the snowstorm by mere miles, mere minutes. He felt not only the foreboding presence of a hazardous blizzard, but also that of something else. Something darker. It felt as if it resonated not only within his soul, but also within the souls of those around him, within the very ground itself. Following this, he slipped it under the tree and began to creep upstairs. He couldn't help but grimace at the thought that he was as far from Santa as humanly possible. “What do you want?” Patrick asked. Innately, he knew that the creature wanted something. The creature smiled, licking his lips. “Thine tender fruit, not spoiled by the worms of new but by the tree that bore it… ripened not into ambrosia but a rotten, hollow core…” “I… I can’t say I understand…” Patrick stammered out. The creature smiled again. Patrick couldn’t understand why the creature would want the game system, but he felt it necessary to give it up. He quickly bolted downstairs, grabbing the box and, clutching it tight, he sprinted back up to his son’s room. The creature, upon his arrival, thrust Patrick’s son to the floor and held out one long, beckoning hand. As Patrick handed over the present, he couldn't help but feel as if he were Faust himself, exchanging an eternity for one single moment of gratification. The creature licked his lips once more and disappeared in the time it took Patrick to blink. He stumbled to the garage before sitting down, embracing his solitude and his communion with the musky smell of paint that seemed to beckon invitingly."}
{"url": "https://creepypasta.fandom.com/wiki/A_Package_Marked_%22Return_to_Sender%22", "title": "A Package Marked %22Return to Sender%22", "author": "Unknown", "publication_date": null, "tags": ["Reddit Pastas"], "content": "Things were pretty normal for the first couple of days. He received a few bills, a bit of spam, and what I could only assume was a birthday card. Then, one evening, I got home to find a cardboard box waiting on his front porch. In big red letters was written “Return to Sender”. It was as I kicked the door for a third time that I lost my grip on the package, and it fell to the ground. I heard a light crack inside. “Shit,” I cursed. Hands free, I finally managed to get the garage door unstuck, and boy did it screech in protest as it rolled up and over me. I dragged the box the rest of the way, setting it in the corner for whenever my neighbor would come back to claim it. And then, I forgot all about it. Until a few days passed, that is. The culprit wasn’t hard to identify. The only change in my garage was the box in the corner. I remember thinking it must have been one of those meat-of-the-month subscription boxes. The meat must have gone rancid from being left out of the fridge for so long. How much meat could have been in there for the box to have been so large and heavy? An entire freaking cow? I returned to the garage, the flaps of the box still open as though inviting me to look. I was prepared, a clothespin pinning my nostrils shut, a garbage bag in one hand, the strongest cleaner I could find in the other, and long rubber gloves to keep my skin from having to touch what was inside. But, as it turns out, I needed none of those things. I called the cops, and naturally, they took me in for interrogation. It’s kind of hard not to suspect the man with a corpse in his garage, after all. Thankfully, they soon realized I wasn’t involved. My DNA might have been all over that box, the smell might have left a mark throughout my house, but there was one piece of irrefutable evidence in my neighbor’s own hands that proved my innocence: a vlogging camera. My neighbor was sitting in the box outside of a shipping facility, laughing as he told the world how he was going to mail himself across state lines. He’d brought pee bottles, food, a pillow, and a few flashlights. His friend – a guy I’d seen at his place several times to help with his stunts –, closed the lid and presumably dropped him off for shipment. Throughout the next couple of hours…or days, I’m honestly not sure, my neighbor recorded a few short clips about his progress. ‘I think I’m in a truck now, I can feel it moving’, ‘Must be in a warehouse. Pretty warm here. Still got plenty of food!’, that kind of stuff. And then, on the last entry, the box toppled over. He broke his neck, and that was it. The camera recorded until either the memory card got too full, or the battery died. There’s one thing I didn’t tell the police after they showed me the video. One thing I heard in the footage that will haunt me to the day I die. Just after the tumble that broke his neck, I heard the familiar screeching sound of my garage door. Credited to manen_lyset"}
{"url": "https://creepypasta.fandom.com/wiki/A_Package", "title": "A Package", "author": "Unknown", "publication_date": null, "tags": ["Items/Objects", "Reality"], "content": "If you don't, your curiosity will get the better of you. Under no circumstances should you open the package. Just leave it outside on the doorstep, don't even touch it, or you'll be further tempted to see what's inside. Don't worry, within the next half hour if you go outside, it will have vanished without a trace, and you'll never see it again. You may live the rest of your life not knowing what was in that mystery box, you may even openly express regret for not taking a peek. Don't worry. It's not worth the trouble. For if you do open the box, you will find nothing. Except, of course, a small piece of paper. On that piece of paper will be a sentence, simple but utterly unsettling: \"You opened the box. You shouldn't have done that.\" \"This is definitely just a sick joke. There's no box outside, and if there is, there's no way all this is going to happen. I'm stronger than that. It's a joke, that's all.\" And you're probably right... Then again, you might not be... I guess you'll have to find out for yourself. The choice is yours."}
{"url": "https://creepypasta.fandom.com/wiki/A_Novice_Killer", "title": "A Novice Killer", "author": "Unknown", "publication_date": null, "tags": ["Dismemberment", "Mental Illness", "Weird"], "content": "I killed my wife last night. How could she be alive? I thought to myself. She must have spilled enough blood to fill a dumpster! See? I thought to myself as I pushed a little harder, trying to coax the chocolate bunny from its hole. There is always a logical conclusion for these types of things. “LIGHT A MATCH!” Credited to Vincent Vena Cava"}
{"url": "https://creepypasta.fandom.com/wiki/A_Note_From_the_World%27s_Luckiest_Man", "title": "A Note From the World%27s Luckiest Man", "author": "her constant financial struggle", "publication_date": null, "tags": ["Reality"], "content": "I am what many would perceive as the luckiest man on Earth. I need to swallow the lump in my throat and collect myself. I need to breathe deeply. I need to wipe the tears from my eyes and the sweat from my brow. Look, all this thinking isn't for nothing. It's not like I'm invulnerable. I've been cut and bruised and bombarded by the ones I love. I’m no stranger to feeling vulnerable and damaged. The only question which resides within my mind now is this. As I write this, I look down at my right arm. The scars and bruises I received from breaking that window cover the surface of my arm. They exist as physical reminders of the deep emotional cuts that still haven't healed. The gun still sits beside me on my desk, and I can't help my straying eyes wandering over to it. The thought of using it on myself is tempting, but I shouldn't. Not yet, anyway. You see, I don't wish to end my life because of the accident, or any specific actions I have done at all for that matter. There's something else. Something more compels me to try and take my life. So please, allow me to further explain my predicament. Many hours and stitches later, my doctor entered the room where I was resting. He approached me; a smile plastered on his face. \"Yeah, just my luck,\" I responded. I didn't care to say anything else, for the man's final words were all I could think of. I can feel the pain swelling within me, and not just in the form of emotional torment. I feel physically ill. My ribs are visible through my rough, leathery skin, and my arms have grown weary just from this minute amount of writing. I sleep twelve hours a day on average, and that doesn't include the various naps I take throughout the afternoon. I need to finish this quickly, so I think it’s time I write candidly to you about my latest plight, and the reason why I ultimately believe I need to go through with my \"suicide\". Three months. Well then, let's test my luck one last time."}
{"url": "https://creepypasta.fandom.com/wiki/Antran", "title": "Antran", "author": "Unknown", "publication_date": null, "tags": ["Historical Archive", "Beings", "Disappearances"], "content": "I was sitting in my armchair with a beer watching television. My boy and ANTRAN were knelt down on the rug, play fighting with one another, as boys do. Suddenly, my attention was drawn to a loud gasp. I looked down and saw my child gripping his arm. He rolled up his sleeve. On his skin was a large, red mark covering his forearm. “ANTRAN pinched me,” he replied, in a shaky voice. A few weeks later, my child came into my room. It must have been early morning. My slumber was interrupted by the gentle creaking of my bedroom door. “Yes, son?” I replied. “It keeps looking at me.” “What? What does?” I asked him, through tired eyes. “ANTRAN. He keeps looking at me, at the end of my bed.” His voice trembled, fearful. I could tell something wasn’t right. I noticed him rubbing his other arm and immediately called him over. Pulling up his sleeve, my heart sank. More bruises. Must have been four or five, all the way up his small arms. I shouted at the top of my lungs for the being, looking under the bed and out the closed bedroom window. Suddenly, there was a loud knock from above us, then hard footsteps. “It’s in the loft,” I whispered, my eyes to the heavens. It was a September dawn; I was sat in my armchair drinking when I heard the pantry door creak open. Again, nothing. Except there on the kitchen counter was ANTRAN'S favourite red toy car. Original author unknown"}
{"url": "https://creepypasta.fandom.com/wiki/A_Normal_Halloween_Night", "title": "A Normal Halloween Night", "author": "Unknown", "publication_date": null, "tags": ["Halloween"], "content": "She began hyperventilating as she said, \"Go-good costume...\" We went towards the next house opening the door, a middle-aged man saw at us as his jaw widened, \"Jesus, don't scare me like that!\" he said. We looked at each other as one of my friends said, \"What do you mean?\" \"It's just a very good costume!\" he said repeating it, whispering to himself, \"Nothing more...\" \"Hello!\" she said. My heart was pounding. \"Trick or Treats!\" we shouted. She only stared. It was almost as if somebody was breathing on my neck. \"Good costume!\" she said. \"So, how much this time my little... boys...\" We looked at each other, because we didn't know what to say. \"A lot?\" I said with hesitation. \"Do... You really think you deserve that?\" \"No...\" one of my friends said. \"I'm joking,\" she said. \"That's the best costume I've ever seen! Have candy!\" I couldn't hold it anymore, so I asked, \"Whose costume?\" and she replied with, \"The guy in the serial killer costume behind you.\""}
{"url": "https://creepypasta.fandom.com/wiki/A_Noel_in_Black", "title": "A Noel in Black", "author": "HumboldtLycanthrope Content is", "publication_date": null, "tags": ["Christmas", "Contest Winner", "Dismemberment", "6 more", "HumboldtLycanthrope", "Monsters", "NSFW", "Places", "Weird", "Horror Holiday 2015"], "content": "Bells on bob-tail ring, making spirits bright. Oh what fun it is to sing a sleighing song tonight. Finally managing to make eye contact with the simian faced bartender who was absent-mindedly pushing a dishtowel up and down a pint glass, Caleb waved a fiver in the air, a wry smile of what the fuck? on his face. Red and green Christmas tree lights flickered over the bottles and mirrors and off in the corner the Ghost of Christmas Past grinned its horrid smile. The bartender nodded acknowledgment and strutted over. “Beer and a whiskey.” “What kinda beer? What kinda whiskey?” “The cheapest.” The bartender got him his drinks, took the twenty, and left his change in front of him on the bar. “Hey there, Santa. Buy a girl a drink?” “Yeah, and what are you, darling? Naughty or nice?” “I’ve always thought I was a little of both.” “Ha. What’s your name, baby?” “Sandra. They call me Sandy around here. But I think of myself as Sandra.” “All right, Sandra. What’s your story?” “Just a local girl, been in the same place too long. What about you, Santa? Don’t you gotta lot of work to do tonight?” Caleb laughed, that deep, reassuring laugh he’d mastered over the years, to put people—women especially—at ease. They talked for a while. Then Caleb ordered a pitcher of beer and a couple more shots and they moved to a corner booth. Sandra talked on and on, chain smoking Salems while he drank his beer and sipped his whiskey, watching as the room began to spin in slow, psychedelic and nauseating circles. “You’re awful quiet.” “I’ve been told that before.” “How’d you get them scars on your neck?” Caleb put his hand to his neck, let it drift down to the dirty fake beard, and pulled the knotted grey and black mess of hair over to cover his throat. And that wicked Ghost of Christmas Past with sunken eyes and yellow teeth whispered, “Tell her.” And so Caleb did. “In the war.” “You were over in ‘Nam, huh?” “Yeah, two tours.” They grew quiet. “So, you going to tell me about those scars, or what?” “Well, I was a Kootchie Kootie. A tunnel rat. You know what that is?” “Oh, yeah. You were one of those guys that go down in those gook holes?” “Oh, baby. You was attacked by an animal down in one of those tunnels?” “You brought something back with you? You mean like that agent orange stuff, honey?” “No, something different. Something, something. . .” “Oh, baby, oh, baby, I understand.” The room was twirling now at a breakneck speed. He was going to be sick. He pulled away from her and vomited on the floor. “Son of a bitch!” the bartender shouted. “Who’s going to clean that up?” Caleb hung over the edge of the booth, retching and dry heaving. “Fuck you, Sam. He’s a veteran! He fought for this country, got attacked down in one of them gook holes. What the fuck you ever done?” “I don’t care if he was on the beach at Normandy. Get him the fuck out of here!” “You’re a piece of work. A real piece of work, know that, Sam? Where’s your sense of Christmas spirit?” We wish you a merry Christmas. We wish you a merry Christmas. We wish you a merry Christmas and a happy New Year. “How you feeling, Santa?” “Good. I feel . . .” he paused, unsure what to say, how he actually felt. “Good.” She knelt down beside the tub, ran her finger over the surface of the water. “Thirsty?” she asked, holding up a tumbler of Scotch and water. “As a matter of fact, I am.” Taking the glass into his hands, he took a sip. Handing it back to her she gave him a penetrating stare that he found hard to decipher and then leaned in to kiss him. She tasted of whiskey, cigarettes and peppermint. But it was good, the way she gently ran her tongue over his upper lip before she pulled away, and Caleb felt himself growing aroused. “Now that you’re all cleaned up, why don’t we get you to bed.” “Sounds good, baby.” “Dry yourself off. I’ll be waiting.” With that she disappeared out the door. He gave her a questioning half grimace and then smiled. “You serious?” “I told you: I gotta thing for Santa.” “Oh, yeah, baby. I’ve been so naughty. I need to be punished.” With that she burst out in playful laughter, turned over onto all fours, and stuck her ass into the air, whispering over her shoulder, “Come and get it, Santa.” He approached the bed and, still standing, he pulled himself into her. She let out a deep moan and he began to move, slowly. He was still drunk as hell and the room was spinning slightly but he could feel that primal urge within to rock and rotate. He began to lunge faster, and faster, and then, suddenly, it was happening again. Fuck. No. No. No. It was happening again . He could feel himself beginning to change as he thrust against her. A part of him wanted to run away, to bolt through the door and into the night so that he wouldn’t hurt her. But another part of him wanted this. It felt good. It felt so fucking good to let go and let the animal inside him take over. Still pounding, Sandra moaning beneath him, he watched in wonder as his fingers—tightly gripping her bony hips—became claws and a thick mat of fur began to weave itself up his arms. Thrusting against her with all his might he lifted his face and began to howl as his mouth filled with sharp, gleaming fangs. Here comes Santa Claus, here comes Santa Claus, right down Santa Claus lane! From his bedroom window her grandson Tommy watched the entire thing. God, the Easter Bunny, and the Ghost of Christmas Present watched as two-year-old Annabelle toddled out the door of her street-level apartment and onto the sidewalk, a thumb stuck in her mouth and dragging a Barbie doll along by the hair. God looked like the guy from the Dos Equis commercials: an incredibly good looking older gentleman with white hair, perfectly coifed, and a nicely trimmed beard, in a tuxedo. The Ghost of Christmas Present looked extremely bored and kept yawning. The Easter Bunny was an out-of-work writer who needed a shave, dressed in a pink bunny outfit. “Cute kid,” the Easter Bunny commented. “I wouldn’t get too attached,” the Ghost of Christmas Present replied, disinterestedly stifling a yawn. Annabelle’s parents were fighting again and they could all hear their voices echoing out from the apartment. “Just how many Quaaludes did you take? You can’t even look at me. Jesus, wake up, bitch, I’m talking to you.” “Fuck off, Henry. You always were a bore.” “You dumb c*nt. I oughta slap the stupid right offa your face.” When the wolf came galloping down the middle of the street in its blood soaked Santa suit the Easter Bunny turned to God and said, “You gotta be putting me on, man.” God rolled his eyes. “It’s probably for the best,” the Ghost of Christmas Past said. “What? Why?” the Easter Bunny asked, scratching at the stubble on his face. “You want to tell him, God? Or should I?” “Is this true?” the Easter Bunny asked God. God grinned and nodded. “You don’t say much, do you?” the Easter Bunny asked God. God just shrugged. Deck the halls with boughs of holly, fa la la la la la la la la. ‘Tis the season to be jolly, fa la la la la la la la la. Father Mulligan was cleaning up after midnight mass when he heard the click-clack of claws on the wooden floor. He paused, chalice in one hand, ciborium in the other, and listened. “Hello?” he called out, his voice echoing throughout the empty chapel. “Who’s there?” Beneath the pounding of blood in his ears he distinctly heard panting, like that of a large animal. “Hello?” The Ghost of Christmas Present laughed heartily. “Well, I hate to say I told you so, but . . .” Joy to the world, the Lord has come. Let Earth receive her king! The Easter Bunny, who wasn’t even wearing his rabbit outfit anymore, and was now just dressed in his usual black jeans and t-shirt, was pacing back and forth irritably. He turned to the Ghost of Christmas Present and asked, slightly argumentatively, “Well, where’s God?” “A concert? What are you talking about?” “Well, it was Skynard and you know how he loves Free Bird.” “Hey there, beautiful,” she said. The wolf just stared at her with its unblinking yellow eyes. The beast crawled atop her and slipped itself into her. When it shuddered and released itself inside her she knew within her heart that she would be with child. This was a happy moment. A glorious moment in time. Another Christmas miracle. Oh, joyous night. She would name this child Stewart, Stewart Kirby, after her grandfather. Afterwards, the beast lay against her, spent. She stroked its fur with her nails and gently kissed its blood drenched snout. In this way the beast kept the girl warm through the coldest hours of the night. Silent Night. Holy Night. All is calm. All is bright. Free in the moonlight as snow began to fall, bathed in the stink of congealing human blood, the taste of flesh and woman fresh on its lips and tongue, the lycanthrope ran, the stars above him a smear of spilled milk, the moon a cataract eye aglow in malignancy. On the First Day of Christmas my true love gave to me. . . And you let go of that aching, awful, agonizing pain of being a man of flesh and blood, the cold slowing down your heart, and give in to death. And as you slip away, into the embrace of the Ghost of Christmas Future, you wonder, “Was it real? Was any of it real at all?” And in the heavens a laughing God finally breaks his silence and answers: “There is no such thing as real. It’s all just a dream within a dream.”"}
{"url": "https://creepypasta.fandom.com/wiki/A_Nightmare_from_My_Childhood", "title": "A Nightmare from My Childhood", "author": "Unknown", "publication_date": null, "tags": ["Dreams/Sleep", "Mental Illness", "Monsters"], "content": "I didn't know where to start. There were so many boxes. Just so, so many. I poked around in them. Old hats, baby clothes, broken toys, and finally, old, childhood books. I started taking them out of the box, one by one, paying attention to the titles so I wouldn't miss 'Rapunzel'. And there, at the very bottom of the box, was the old picture book lost in a mess of mess. I looked over it carefully. The gold tin lining around the outside of the book was torn and dull, and the cover was damp and dirty, but it seemed as if the pages inside of it were perfectly clean. So I took the book back upstairs, not bothering to clean up the other books, and ran to my room. I shut the book and stepped out of my closet, and into the safety of my warm bed. The book sat straight across from me, and, being so afraid of it, I threw one of my pillows at it. It fell over, revealing the torn back cover with words that I could barely understand even though they were so big. I couldn't look at that book ever again. I wrapped it in paper and folded it into five plastic bags, and hid it in the darkest corner of my basement. I never wanted to see that menacing little goblin ever again. I'm not sure, but when thinking about it, he may have been taking me to hell. The dream alone was just awful, but this element alone is so dark and creepy. I also remember there was another version of the dream, where I get out to the car before my family leaves, and they bring me with them. And when I look out the car window, there was the little goblin. Only he wasn't cackling—he was just staring at me with those terrible eyes. And he wasn't happy."}
{"url": "https://creepypasta.fandom.com/wiki/A_Nightmare%27s_Reality", "title": "A Nightmare%27s Reality", "author": "Unknown", "publication_date": null, "tags": ["Dreams/Sleep", "Mental Illness", "Disappearances"], "content": "Oh dear god... Shortly after her father’s death, the nightmares began. These were not your everyday nightmares. Not the usual falling, finding yourself in school in your underwear, no. Willow seemed to be completely paralyzed. She couldn’t move or try to touch anything. The whole time she was dreaming everything was disturbingly silent for the most part, except for the occasional blood curdling scream. When she saw him in the nightmares, it always seemed like he was among the worst of the disfigured; sometimes looking like he was run over by a train or murdered with a chainsaw; but she could always see that scar. She also would see some of her acquaintances that Willow ran into from time to time, the checkout girl at the local convenience store, an elderly man she saw at church, a handful of her classmates, but no one she knew particularly well. Then she turned seventeen. The night before that particular birthday, the nightmares were particularly horrifying, the images even more vivid. She emerged from sleep with a jolt, tears streaming down her face. Willow lifted the covers off of her with trembling hands, almost losing her balance as she stepped on the ground. One hour later, the high school girl boarded the train that she took every day. Taking a seat, she noticed that Jonathan wasn’t there. She saw only his mother, who seemed to be sobbing to herself. Concerned, she walked up to her. “Miss, I know I don’t know you too well but I’ve seen you around. May I ask what’s wrong?” The Voice of the mother surrounded her, as this poor woman was frantically asking if she was okay. It’s not every day some high school girl has a mental break down on a train. Willow snaps out of her panic attack, and faces the woman. “Sweet heart, are you okay?” She said. Willow nearly dropped her textbook right in the middle of the hallway. She was understandably beginning to panic. This was getting too weird to be a simple coincidence. It was clear that there was some correlation between her dreams and the chain of events that were occurring before her very eyes. She knew one thing: Today was going to be a sick day. She walked to the office, shaking. The nurse turned to face her. “What’s wrong, Willow?” She said, concerned. She was one of those people in the school that knew everyone’s name. “You don’t feel warm…” She said, skeptical “but I can see you need to go home” Before she knew it, the night rolled around. This time the dream was about that guy from her church; seventy-something William, the next night, her neighbor, fourteen-year old Joel. Then, out of nowhere, something terrifying happened on the third night. “Where am I? Please, someone help me, please!” Much to her surprise, she was answered. “Who are you?” She shrieked, “Where am I? Please, let me go!” “My dear Willow” he came over to her, and graced the bottom of her chin with his ice-cold, bony fingers. “Now I can’t let you go so soon. I haven’t even gotten to fix you yet.” The disturbing thing about his words was the warmth in them, despite the dark, morbid meaning. He spoke like a loving father, comforting his child. “You must have seen this coming, I have been warning you for more than a year now.” “Warning? How?” He chuckled. “You really did think those were dreams, didn’t you?” “See here young Willow, it’s not too hard to drug someone. I would simply give you enough of the drug to paralyze and confuse you, take you with me, and put you back. I did this with a few other people too; I think you may recognize a few of them. But then there were the times I got a bit… carried away.” He chuckled again and motioned towards the bodies. “But some of those people, they were murdered! And then they were fine, I saw them again later!\" “Well I didn’t take you here every night dear. I wouldn’t doubt that you did actually dream about it sometimes. The mind is a funny thing.” He grinned in the most disturbing fashion Willow has ever seen. “You haven’t taken off your tank top in awhile, have you?” He said. “What did you do ?!” She screamed “My father?” “See here, when we were in our twenties, we worked together at a factory. You were a newborn then, and you were the most beautiful girl. It was a very modest job, but he did what he could to provide for you. We weren’t the best of friends, but we were friends. No problems.” He paused, turned away and grimaced. “Then one day, oh that one day, there was a massive fire in that factory. Willow closed her eyes as the man laid her on the wooden plank and strap down her limbs in a fashion similar to the old medieval torture method known as “the rack”. “I’m sorry we have to spend our last moments like this, Willow. But it must be done. The only reason is that you have impurities caused by him. You have too much of your father in you. I know you’re scared, but I know what’s best.” He reached into the pocket of his hardly-intact jeans and pulled out a sharp, surprisingly clean scalpel. “Now keep in mind, he’s leaving you. You’re going to be better soon.” Without saying another word, he stuck the scalpel into the young girl’s arm. She cried into the empty air in agonizing pain, tears streaming down her face. He put a hand gently over her mouth. “Let him leave you.” He repeated the process with the other arm. He ran his fingers through her hair; to sooth her in some twisted way. “I can be with you now, Willow, forever…”"}
{"url": "https://creepypasta.fandom.com/wiki/A_Night_on_the_Tracks", "title": "A Night on the Tracks", "author": "FantasyPhantom Content is avail", "publication_date": null, "tags": ["Monsters", "Nature", "We Go Bump", "Places"], "content": "“You’re never alone.\""}
{"url": "https://creepypasta.fandom.com/wiki/A_Night_of_Trepidation", "title": "A Night of Trepidation", "author": "Unknown", "publication_date": null, "tags": ["Monsters"], "content": "To my side was an old, rusty lantern. Its glass was cracked, but it appeared to still be usable. As I reach out for my only source of light in this dark place, I notice my strange clothing. I was wearing a long, light blue and lavender, Gothic Victorian styled dress. It was tattered around the waist, and was missing sleeves, but seemed to fit well. I take a step back from the large door, contemplating my next move. Out of the corner of my eye, I could have sworn I just saw one of the old, dusty curtains close abruptly as I take notice of my surroundings. Was someone inside, watching me? That seems to be the only explanation. But then again, it could have been my corrupt mind playing tricks on me. That's when I notice it. Alongside the dark stone wall, just out of reach, was an assortment of thick vines. If I could find a way to grab onto them, I'd be able to climb my way up the wall, and finally get inside this building. But why do I want to even get inside? Any sane person would immediately turn away at the sight of the mansion, but I chose to find a way in... Perhaps I'm not sane. I'm not sure why, but there is just something about this place... It feels like I need to be here. To be within the walls, to find a purpose of why I ended up here. Grimacing, I take hold of the handle and pull open the heavy door. In front of me was a long, dark hallway, only lit by a few torches that were very sparsely placed along the walls. The hall was also eerily cold, and I could see my shattered breaths before me, floating in the air and slowly dissipating like a ghost. \"Don't let her escape...\" A small whimper emits from my throat and I begin to shiver. What now? I could hide, but I know nothing about this old building. I could try to escape, but I'd have nowhere to go even if I somehow succeeded. As I stand there, I hear a loud growl from somewhere behind me. I turn around once again and my limbs go numb. I couldn't move, I couldn't do anything. All I could do was stand motionless and in horror, staring wide eyed at the horrid creature before me. He continued getting closer, and closer, until he was merely a few feet in front of me. He reaches out, and my limp fingers drop my lantern. It crashes to the floor, the glass breaking into a million pieces. All the lights in the hall burn out, and I'm left with no sense of sight whatsoever. I scream out in tears as I feel a sharp pain make its way through my abdomen, and a warm fluid that I can only imagine was my blood drips from the wound and down my waist. I fall to the floor and curl up into a ball, near death. The last thing I see is an old man carrying a torch enter the hall, an evil grin across his face."}
{"url": "https://creepypasta.fandom.com/wiki/A_Night_of_Hell", "title": "A Night of Hell", "author": "the way they were bringing the", "publication_date": null, "tags": ["Demon/Devil", "Hospitals"], "content": "“Jesus Christ!!” I shouted as I instinctively stepped back away from the flailing claw. “Child! What child??” interrupted Doctor H. “My God! Where is the child now?” “Down at the Orphanage Sir, she was unharmed other than being cold to the bone,” Rick finished his story with a shudder that shook his entire body. I nodded towards the Priest as he walked to me and simply said, “Father.” I've never been a religious man myself so I wasn't sure if there was anything else I should say or not so I stood there feeling uncomfortable about the whole situation. The priest spoke to me, “Son, what is to happen here tonight must never be spoken of. Doctor Hemmerman has told me that I could trust that of you, is that so?” “Yes Father, but what..” that was as far as I got before he walked past me into the room and firmly shut the door. At first everything was quiet for the first time that night, all I could hear was the tapping of the rain against the metal roof of the center. The thunder seemed to have calmed and if the patient was still making noise it did not penetrate through the thick wooden door."}
{"url": "https://creepypasta.fandom.com/wiki/A_Night_in_the_Woods", "title": "A Night in the Woods", "author": "the way. Particularly I liked t", "publication_date": null, "tags": ["Beings", "Nature"], "content": "“Hey dude get up,” he said. I rubbed my eyes as I hesitatingly sat up. “Ah, what is it?” I asked him. “Don’t ya hear that?” he asked. I did hear something. Faintly. It sounded like something whistling. Not like a bird, singing a happy tune in the orange sky, but real whistling. HUMAN whistling. I went out of the tent with the lantern, my hand shaking slightly, to see where it was coming from. I looked forward. My house's lights were getting nowhere near where we were. I looked to the left. Nothing but grass and trees in the distance. I looked to the right. It got slightly louder. I shined the light in that direction. I saw nothing but trees and grass. I thought I could slightly see the outline of some sort of animal near the trees. The woods were at least two hundred meters away so I couldn't tell what it was. All I saw was that it was on four legs. For some reason I decided to whistle back. I whistled a simple, very short tune and just stood there...waiting for something to happen. And sure enough as soon as I started to go back in the tent, I heard the thing answer. And it wasn't random. It mimicked the sound perfectly. There was no fucking way it echoed. It was too far away to echo. “What the hell?” Jake said quietly. “What the hell is this?” I said."}
{"url": "https://creepypasta.fandom.com/wiki/A_Night_in_the_Hospital", "title": "A Night in the Hospital", "author": "EmpyrealInvective Content is av", "publication_date": null, "tags": ["Disappearances", "EmpyrealInvective", "Hospitals", "2 more", "Mental Illness", "Videos"], "content": "\"A Night in the Hospital\" by EmpyrealInvective - Creepypasta (Narrated by Creeparoni) \"A Night In The Hospital\" (Creepypasta by EmpyrealInvective) Narrated by KingSpook “Please tell us what happened the night of June 13 th . Be as specific and detailed as possible.” Look, I’m going to make this as quick as possible for the obvious reasons. I will give my version of events for why I was fired and you’re going to do your damndest to try and get me my severance package or at least something to keep me going in-between jobs. How does that sound? Do we have a deal? Christine arrived and was taken up to the OR wing of the hospital. This wasn’t because she needed surgery, but because the OR was shut down on the weekends. I always assumed it was closed because the surgeons wanted some time to play a round of eighteen holes on the weekend without having to worry about checking in on their wards. She was brought into the OR because there weren’t a whole lot of people there and it would be easier to keep all non-essential personnel out of the way. She started to cry and there wasn’t a single thing I could think of to say to calm her down other than, “It’s over.” He kept pressing and eventually I relented under the condition that I stay in the room while he was there. I brought him into the room and he stood over the broken body of his girl. It looked like he could barely contain himself at the sight of her injuries, but he managed to keep himself under control. As she was unconscious, there wasn’t much he could do or say to her. He stroked the side of her face and then sat down next to me. We sat in silence for five minutes before he struck up a conversation with me. He told me that his wife would be here shortly. We talked a little more. It was mainly small talk. I can’t even remember what we talked about exactly. He was more focused on Christine than talking, but I think he felt uncomfortable with the silence. I don’t have an exact time, but I think we probably dragged the conversation on for an hour or so. It was around 7:30 when Christine started to come to from the sedative. She spoke in a whisper, but it felt like she was shouting the words right into my ears, “It was him. ” I croaked, “What did he tell you?” She looked up at me and in that moment her eyes were as wide as saucers. She said, “He told me that he ‘loved the time we spent together. And that we should do it ag-’” The rest of the words caught in her throat, and she broke down wailing and weeping. My boss arrived at around that time and I was fired almost on the spot. That’s my story. I know I messed up, but how could I have known who that guy was? Well now that I say it all out loud, I guess I really was in the wrong on this. I doubt I’m going to get a termination package. This trip out here was a waste of time, well not completely, maybe I’ll go give Christine a visit… Why are you looking at me like that? What’s going on here? This whole interview thing wasn’t about my severance or wrongful termination. This interview was about Christine! Oh God, is she all right? “Christine has been missing since last night. We have no clue where she could be.”"}
{"url": "https://creepypasta.fandom.com/wiki/A_Night_in_the_Forest", "title": "A Night in the Forest", "author": "ourselves", "publication_date": null, "tags": ["Alparos-Lilah", "Places", "Items/Objects"], "content": "As we dug through the hard gravel, we came across a hand, a little girl’s hand, covered in dry blood. Narration: A Night in the Forest (YouTube Video)"}
{"url": "https://creepypasta.fandom.com/wiki/A_Night_in_the_Ammo_Handling_Area", "title": "A Night in the Ammo Handling Area", "author": "every metric", "publication_date": null, "tags": ["Military", "Beings"], "content": "As I expected, as soon as we arrived at the training area, I was placed on camp tax. For those of you not in the know, camp tax is essentially where the unit would place all the shitbags such as myself to do bitch work around the cantonment area. Picking up trash, cleaning toilets, working in the chow hall, and other such tasks. I walked back to my tent and right away I knew something was wrong. My tent was open. I scurried over and looked inside. My cigarettes were gone. Fucking thieves, I thought. As I pondered what I was going to do, I heard laughter. I glanced over in the direction where it came from, and I saw Davidson standing in the smoke pit, smoking a cigarette. I knew for a fact that he ran out of smokes a week ago, and no one here liked him enough to give him one of theirs. Rage growing inside of me, I stomped towards him. In hindsight, I could have handled that better. I won’t go into too much detail, but the situation ended with Davidson being taken back to cantonment to see the Corpsman and me being put on firewatch all night. I was going to have firewatch for multiple hours every night for the rest of the time we were out there. Fuck. It was a little awkward at first, having to spend several hours every night walking around in a circle with a guy I knocked out, but after a while the awkwardness dissipated, and soon we were talking and laughing like old friends. Him bringing me a pack of Marlboros to make up for the one he stole certainly helped. More days pass, more maimed goats, their corpses inching closer and closer to our sanctuary. During our watch, me and Davidson would try and see what was causing the depopulation of the local goat community, but we never could. It was too dark, our tiny flashlights only shone so far, and our NVGs were back in the armory in cantonment. It was a complete mystery to us, until one night. During our watch, we were talking, just shooting the shit, when we heard a shrill scream. It sounded just like a person. We both jumped and spun toward the direction of the scream. We both let out a sigh of relief to see it was just a goat, standing on a hill, illuminated by the moonlight, about twenty meters away from us. Those old YouTube videos are right; a goats scream sounds just like a human. All day the next day, we begged Sergeant Hart not to put us on watch outside the perimeter of the AHA. We argued that it was unnecessary from a security standpoint, as there was a tall fence that surrounded the AHA. He told us that he didn’t care, and that it was our punishment for fighting each other and embarrassing him. We then offered to stand firewatch the whole night, every night, for the last few days we were here, just behind the fence. Me and Davidson both sighed in relief when he agreed to those terms. Everything went to shit on that last night. “What do you mean, he’s gone?” Sergeant Hart barked at the young PFC. “I-I don’t know, Sergeant! I looked inside his tent to get him for his watch, and he was gone!” The PFC stuttered back. “Great, this is the last fucking thing I needed.” Sergeant Hart growled. He than turned to me and said “You, Davidson, and PFC Dumbass here are going to go find him and bring him back.” I immediately objected. “Sergeant, you can’t be serious, it’s the middle of the night, it’s dark as fuck out, and we don’t know which way he went! We need to call this in!” I didn’t mention the real reason I didn’t want to go, because I knew he still didn’t believe me. “Fuck no!” Sergeant Hart snapped. “If I call this into the COC, I’m fucked, which by extension, means you’re all fucked. Shit rolls downhill!” “Echo Five Hotel, this is- “ “Fuck!” I exclaimed angrily. I exchanged a glance with Davidson. “Did uh, you happen to bring an extra battery?” I asked. “He’s right.” Davison chimed in. “If Sergeant doesn’t hear back from us, he’ll be more pissed than before.” “Alright, let’s get- “ “When we get back to the AHA, I’m personally going to fuck you up, then Sergeant Hart’s going to fuck you up, and then when we get back to cantonment, I’m going to- “ “Where’s Scott?” Davidson panted. “It fucking killed him!” I gasped back “Hart should have let us bring our fucking rifles!” Davidson angrily exclaimed. Davidson tried to convince Sergeant Hart to let us bring our rifles and some ammunition, but he refused, he didn’t want to risk us losing them or having a negligent discharge. He insisted that if there was something out there, it probably wouldn’t bother us. He was a Sergeant, so he knew better than us. “Oh my god, fuck…” He panted. “I can’t go on, I can’t breathe…” I stopped and screamed at him. “Davidson get the hell up! We’re almost there!” “I can- I can’t breathe…” “Throw me on you-your back and carry me.” All he told me about the creature I saw was that they were aware of its existence and that the situation was under control. I kept in contact with a few of the guys who were there that night. Surprisingly, most are still in the fleet and are now NCO’s. We didn’t really talk about what happened, most of them didn’t really get the whole story. The whole real story anyway. As the weeks went on, I kept seeing obituaries and memorial posts popping up, all for the guys who were at the AHA that night. The causes of death were all crazy things; car accidents, training accidents, undiagnosed medical conditions, stuff like that. By my count, I’m the only one left, which is why I’m writing this. I don’t think I have much time left. For the past few days, I’ve been locked in my room. I’m afraid to go outside. I’m being watched. From my window I can occasionally see a black van drive by, I know it’s the same one every time from the license plate, and I swear I can hear a helicopter fly by every so often. Helicopters have never flown by my apartment before last week. I’m praying to God that this is all just one big coincidence and that I’m just losing my mind. What I do know that if this is all real, I’m not going let them make my death look like an accident. I am perfectly healthy, I don’t have any dangerous hobbies, and my job isn’t dangerous. I am not planning on hurting myself. If they come for me, I’m going to fight. They won’t be able to make it look like an accident."}
{"url": "https://creepypasta.fandom.com/wiki/A_Night_Spent_Waking_Up", "title": "A Night Spent Waking Up", "author": "WaveDivisionMultiplexer Content", "publication_date": null, "tags": ["Crime", "Dismemberment", "Beings", "WaveDivisionMultiplexer"], "content": "“That is, of course, if what he says is true.” She went on. “And we can’t truly place him in the position of a suspect. It seems to be a case of self-mutilation, but why would the victim -and I say victim because I’m still not convinced, have a reason to do this to herself?” Nothing? She thought, confused. Then she picked up the pillow and tried to see where it was, if it were there at all. The warm sweat and drool on her pillow moistened her hand and as the thirsty winds fed on the moisture; she felt cold. She felt with her free hand for her cell-phone. There! She found it. Good, well. Isabella could still feel her salivary glands pouring thick, water-deficient saliva into her mouth. Perhaps a little more. This time she was careful to drink slower. She filled her stomach with water until she could feel the unease of a strange wobble inside. Now all she wanted was to go back to her bedroom and sleep; okay, stay awake and be quiet about it. She must have woken up someone with the racket she created while she switched on all the appliances. The golden glow of the microwave stared back at her under the flutter of the ceiling-fan, bathed in another glow that was the local lights. She found herself pressing again, at the other end. Light was back from the CFL. And now she sat again, on the stool, waiting patiently for the night to end, and despising guests. “By the state of her body, she couldn't have possibly done it herself,” he said in a single breath as he stared into the picture at last, disturbed by it but also too stupefied to look away at this point of time. “And why do you think so?” Cathleen stepped into the darkness to let him have a complete view. She suppressed a smile, for she knew exactly why he thought so. “Mum, mum wake up!” Beatrice shook her mother’s shoulder as she slept. It was very early in the morning and Beatrice’s mother was not excited about the fact that she was being woken up, but sensing the emotion in her daughter’s voice, she did so anyway. “What is it, Bea?” “It’s Isabella. She’s awake.” Hearing this, Martha mother was mildly annoyed. She knew her older daughter to be an insomniac, especially while under the pressure of coming exams. And thus the situation was explained. “Answer me,” she demanded. Isabella turned to her mother, slowly, mechanically. Her eyes were dark and dull. She broke into a straight, fake smile after what felt like a lifetime. “Why wouldn't I be?” “Why wouldn't you what.” “Be alright. Why wouldn't I be alright?” \"That's because I was.\" “And just how would you know that.” Martha sat back and crossed her hands, silently checking her own pulse and willing it to be slower. “You are scared. And yet you refuse to believe it.” “BELIEVE WHAT.” “Are you going to cry? I’m sorry if I’m making you cry.” Inside the bathroom, the older sister looked for a while, and when she found not what she sought, she walked out again, this time, glaring at Beatrice and flashing her a short, sharp smile. Bea, the little clumsy girl, was now chewing her hand, but not really getting anywhere. She would need sharper teeth than that, her sister thought as she left the room. That gave her an idea. But then WHERE did her father keep his stupid razors?! “Isabella, hon, what are you doing?” “Nothing, father, just go back to bed. You’re safe in bed.” Turning around, he checked the clock. It seemed to be stuck, and the hour’s hand moved back and forth from 3 to 4, visibly fast. Samuel stared at it for a while, feeling oddly dizzy. The bathroom door slammed shut. It stung, it hurt, but that was okay. Flakes of enamel fell into the sink, with a little blood, too. This did not concern Isabella as she chipped off further, staring right into the bathroom mirror as she did. She knew that it would all soon be worth it, in a while. “They seemed to be in it together, but nobody was there in the bathroom with her.” “How do you know? Harris just said that it wasn't suicide. It could have been her family members, most likely her father,” another officer pointed out. “It wasn't.” “What makes you so sure?” somebody asked. She sighed. “Well, whatever it was, it was contagious. Her sister, Beatrice her name is, is in care right now; they’re trying to keep her from nibbling at her hand. Her mother hasn't ceased crying, and the only person who can talk is the father. It’s clear that he’s in shock too, but he seems to be convincing himself that he saw somebody inside. No traces were found though, not even fingerprints.”' “So someone could have been there?” “I have interviewed everyone related to the crime scene. I can assure you that the possibilities of a person being there are few.” “What other information have you gained from the interviews?” “What did he say?” Cathleen pressed a button on the remote. “… Something downright frightening.” “WHAT,” she shouted back, “do you want?” “Open the door. NOW!” “I’m bathing,” she gurgled through the blood. “OPEN THE DOOR ISABELLA.” “This is what he said he saw.” The lieutenant paused. She believed in a snappy briefing and even quicker justice, but here she felt like a person narrating a story as the listeners sat around a camp-fire and ate burnt marshmallows. “Artist: Isabella Smith, and one hell of an artist too. Object: her imaginary friend from long ago.” A little girl with a triangular body and crooked lines for limbs, holding the hand of a grown man with a scar across his eye; the same strange man in the middle of the playground, out of place in the whole picture; a forest with the same little girl walking with the man, but she did not seem so happy; her in chains, very detailed chains, with the man sitting there, just staring; herself again, disembodied with several faceless kids glaring down at her flesh and pieces. Each drawing was better than the last, and finally the same one again, with the man at the bath-tub, his scar fresher than ever. Inside, Isa wondered why he bothered at all. What was done was done. She just hoped the lock would not break before she could finish, that it would not fail her in this lifetime. Haha, a lock with a life. Funny. The projector screeched. The slides started to play again, from the beginning. This, Cathleen thought, was not part of the briefing, or rather, story. She pressed frantically at the buttons on the remote, and finally after several failures, she walked up to the switch and pressed the reverse end of all switches. The air was filled with a burning smell; the projector was destroyed. And suddenly, there was darkness. Suddenly only darkness. The man at the bathtub greeted Isabella’s father with a smile. It seemed that the case was Isabella’s and hers alone."}
{"url": "https://creepypasta.fandom.com/wiki/A_Night_Out", "title": "A Night Out", "author": "Unknown", "publication_date": null, "tags": ["Mental Illness", "Mirrors"], "content": "“Strange how paranoia can link up with reality now and then.” ― Philip K. Dick, A Scanner Darkly The only reason I came to Seattle was because of all the great job opportunities after college, but like all my other plans, things didn’t go the way I’d hoped. But out of all the stuff I’d be doing tonight, there was one thing I was looking forward to even more. This girl I like, Reyane, will be tagging along with the rest of us. And who knows, maybe if I make a good impression on her, next time it might just be the two of us? About 30 minutes before I was supposed to leave, I was in the bathroom, brushing my teeth, enjoying the thought that soon I’d be at the movies with everyone. I’m staring into the mirror, brushing each tooth individually, counting each stroke, kind of like in that movie... what was it called? “Stranger Than Fiction”? Yeah, that was it. I’m nowhere near as insane as Will Ferrell is though. As I continue brushing my teeth, I get a sudden chill. Have you ever gotten the feeling that you were being watched? Like someone was right behind you without you knowing? Like anyone would do, I take a look around me just to make sure that I wasn’t being watched, even though I knew no one was. It’s like getting soap in your eye while taking a shower, you close your eyes for a few seconds, but then get the feeling someone is behind the curtain. There were a group of teenagers hanging out near the entrance to the complex, and my neighbor’s dog was barking like crazy. It does that whenever it sees people it doesn’t recognize. It gets annoying at times, because despite the few people that live in this building, we get a lot of visitors. Sometimes the dog will wake me up at night when a group of joggers jog past. Reyane comes up to me, noticing my expression. “Scared?” she says as she smiles and walks towards the theater. I knew I couldn’t pass off this eerie feeling, cause now I’m more paranoid than ever. I’ve never been the biggest fan of fog. Tons of accidents happen due to the idiot drivers who forget to turn on their lights and end up colliding with another car. But driving alone in the fog after watching a horror movie can make you paranoid beyond belief. Did you ever watch the television series, “The Twilight Zone”? I distinctly remember an episode about a girl who decided to take a trip across the states, and there would always be a man popping up everywhere, just out of the blue. There, sitting in the back, was a man. At least, I think it was a man. He was covered in a silhouette of darkness, but the figure looked like that of a male. For 10 seconds, I just stared. I couldn’t speak, move, or even breathe. I just looked into the mirror and watched as the man sat there silently. I quickly turned around, only to find nothing but empty fast food bags and other garbage. This was getting out of hand. I couldn’t handle what was going on, my mind couldn’t comprehend what was happening. It wasn’t my brain's fault. I can’t blame it on being tired anymore, because at that moment, I was wide awake. And all I could think about was getting home as soon as possible. I sped up, and in a matter of minutes, I was home. I checked in my side-view mirror this time, and about 30 feet away, I saw a distinct figure walking slowly to my car. I got out of the car as fast as I could, and bolted up the stairs to my floor. I look over the railing. This time I knew he was real. I see him by the car, slowly walking towards the stairs. He was after me. I started pounding on all my neighbors’ doors, begging for help, but no one came to help me. I looked over my shoulder; the man was walking up the stairs. I ran to my door, bolted into my apartment, slammed the door shut, got into my closet, and just waited. It felt like an eternity. I waited in that closet, hoping for some sign that I would be okay. I heard the neighbor’s dog barking outside my apartment, and that can only mean it sees the man as well. Hearing this meant that I was not going crazy; he is, in fact, real. What was going to happen to me? Was he going to kill me? The footsteps stopped right outside my front door and I realize something..."}
{"url": "https://creepypasta.fandom.com/wiki/A_Nice_Play", "title": "A Nice Play", "author": "Unknown", "publication_date": null, "tags": ["Monsters"], "content": "Hey, my name is Jake. I'm twenty years old, and I want to tell you about an \"accident\" that happened about ten years ago. And boy, was I wrong. So, it was a normal, boring day in class. Math, Lunch/Recess, Literacy, Social Studies, more Math, Lunch/Recess, art, then the end of the day. But, at the end of the day, we were asked to put these forms in our planners. They were forms, for a play. We could \"audition and have the time of your life, or stay at home doing nothing but play video games.\" I, as a ten year old \"cool kid\" wanted to boast about being the only person in the class to go to the play. All of my friends said, \"That's your choice,\" and I'd just say \"Yes, it is.\" Three weeks later, it was finally time. My parents drove me to the auditioning place, I did my act, and I did good. I passed. He said to wait another week and your parents/guardian would drive you to the theater. One week was like one years at that point, so I just did normal things until that time. On Monday, after school, my mom drove me to the play. The outside looked like shit, but the inside looked beautiful. I was in the backstage, getting my costume on. Twenty-three minutes later, when all the people arrived, they play started. I can't remember what it was about, due to things that you will hear later in the story. Only thirty-two more minutes. I was having the time of my life, performing, and the main character was talking to me, when suddenly, the lights went out. I tried to look for a source of light, but couldn't find one. I heard a scream, near me. The lights went back on. A hideous shriek was heard, and I covered my ears the second it started. I hear a noise. I ran around and the lights came back on. I puked at what I saw. Something, pure white. With organs, intestines, hell, even kidneys all over it. Still no blood. I ran out of the stage room, and went into the lobby. I heard a loud scream, but not from just one person, it sounded like half of the audience. I went outside, and found my mom waiting in the car. I cried, and begged her to take me home. She put me in the car, I buckled my self in, and we drove off. And, when we were driving, I saw the same creature. Pointing at me. I have recovered from the incident since then, but I can still remember it. Sometimes I wonder where that creature is right now. Is it outside my home? Or watching me when I sleep? I don't know, but I always know, that no matter where I am, it will point at my direction. Or directly at me."}
{"url": "https://creepypasta.fandom.com/wiki/A_Nice_Hot_Shower", "title": "A Nice Hot Shower", "author": "Potatochan", "publication_date": null, "tags": ["Animals", "Dreams/Sleep"], "content": "My mother opened my door as she did every morning. “Cory, time to get up.” My eyes were only half opened, and I moved mostly on muscle memory as I shuffled to the shower and pulled back the curtain. I turned the handle. As usual, the water came out icy cold. I held my right hand underneath the water until it started to feel hot, and then I stepped into the shower. I like my showers very hot, and this one was the perfect temperature for me. I closed my eyes and relaxed under the hot stream, feeling the water hitting my back and neck. Steam swirled around me, and I let the shower begin to ease me awake. My mother opened my door as she did every morning. “Cory, time to get up.”"}
{"url": "https://creepypasta.fandom.com/wiki/A_New_Noise", "title": "A New Noise", "author": "any means. I took martial arts", "publication_date": null, "tags": ["Beings"], "content": "The first time climbing that mountain was a huge breath of fresh air. I felt that cool spring morning breeze, and I saw the waist-high yellow grass swaying in the wind. I heard my feet stomping against the thin dirt trail, and the sound of birds chittering nearby. It felt like heaven. I remember reaching the top of the hill, out of breath and sweating all over. It was an uncomfortable reminder of just how unfit I was, but was quickly swept away as I began to take in the view. From the summit, I could see almost the entire town below. It hit me then. Now that I was sixteen, that entire town was open to me. It felt huge and miniscule simultaneously, as I also considered the size of the outside world. That changed everything. Suddenly, I was outside daily. Not only was I getting stronger, but I was thoroughly enjoying every single moment of it. That hill almost became my home away from home, in fact. Every day I’d stomp my way to the top, only to make my way back down again. All the while, I listened to the noises of the mountain. There were very many of them, in fact, there were more than one like myself might initially expect. I doubt I’ve even heard them all. That was my first time encountering a predator. That type of encounter--that type of noise--is one that leaves a lasting impression. Even when the creature isn’t large enough to eat you, knowing that something with the ability to severely wound you lurks just out of sight is a terrifying feeling. Back then, I didn’t immediately register that a rattlesnake was making that noise, or how close exactly it was, but I knew just from that sound that the best thing to do was to simply back away. Predators are frightening creatures, and their presence should put anyone on edge. Healthy fear is a wise thing to have. I no longer hike there. I no longer hike anywhere, for that matter. Nobody questions me when I stubbornly refuse. I never go out at night anymore, either. I did once, and that alone scared me away from it. Well, for a year or so, at least. Whenever I went out at night, no matter where I was, I began to hear those screams again. They would start low, then begin to rise. It shouldn’t be possible. I’m deaf now. But that never stops them. I regret everything, now. I regret so much as stepping outside. I’m miserable, and nobody can console me. Do you have any idea what it’s like to live without noise? Especially when you can vividly remember every sound from when you could still hear? It’s disturbing, to say the absolute least. Doctors tried everything, of course, but nothing worked in the end. It’s utterly miserable. That’s why I’m outside writing this. The screams are getting louder and louder, and I see shapes shifting in the dark. I think they’re coming for me, but I never really knew if they would kill me, or if they just wanted to taunt me. Maybe I’m just going insane. Nevertheless, I can’t go on like this. I think I’ll wait for now, and see what they do. Before, I was too scared to find out, but not anymore. And if these really are my last moments, well… at least it won’t be silent."}
{"url": "https://creepypasta.fandom.com/wiki/A_New_Moon", "title": "A New Moon", "author": "TheZombie'sBrain Content is ava", "publication_date": null, "tags": ["Beings", "Nature"], "content": "Thomas was an avid hunter. He would grab his shotgun and go out into the woods almost every day. When Thomas would get back, they would eat whatever game Thomas could find. Johnny always wanted to go hunting with his father, but Thomas said that it was dangerous to go out into the woods. One day Johnny got curious. After his father left, he decided to go out into the woods. His mother thought that he was just going to take care of the livestock. Johnny thought that his father would find him, or that his mother would call his name, \"Johnny, Johnny are you okay?\" Those words rang out in his mind like the screeching of a bobcat. Johnny didn't know where he was. Johnny was lost. He suddenly heard the snapping of a twig behind him. Johnny saw the trees looming over him, the glowing eyes of the owl staring him down. Johnny turned around as fast as a bullet. His bright blue eyes widened when he saw it. It was a humanoid squatting towards the ground. Its skin was snow white and completely hairless. It was the size of a black bear and one of its three-fingered hands was laying on top of the now broken stick. Its other hand was in mid air, as if the thing was crawling towards Johnny. The thing's face was completely blank except for a wide, gaping maw. It was standing still, like a statue. Johnny tried not to blink while backing up, slowly. It just stood there, not moving a muscle. Johnny then threw the rock to his left; it landed in a stream with a splash. The creature looked in the direction of the stream and darted towards it. Johnny got up and started to run back to the house. He didn't look back. He saw the fields of grass and the barn in the distance. He heard a loud shrill noise, louder than a mountain lion's roar. Johnny ran out of the woods and into the barn with the livestock. Johnny fell to the ground and rolled into the fetal position as some of the sheep started to panic. Betsy walked over to him cautiously, never seeing Johnny behave this this before. She mooed at the boy, trying to comfort him. Johnny looked up at Betsy and told her to stay quiet. Johnny then realized that it was dark out; it was a new moon. He laid there in the hay for what seemed like hours, with some of the hay going into his light blonde hair. He heard a growl come from the roof of the house. He saw his mother walk outside of the house with a lantern in her hand. \"Johnny, where are you?\" she asked. Johnny wanted to reply to her, but he didn't want to give away his position. The creature crawled down from the top of the roof, slowly, like a snake slithering towards a mouse. Marie walked down from the porch and called her son's name as the creature's long arm reached out towards her. Johnny and the animals silently waited for the inevitable. Johnny looked around for a rock to throw; there was nothing. Suddenly, a gunshot boomed from out in the woods. It was Thomas, alone, far out. The creature's cover was blown as it screeched and turned around as it ran off into the woods. Marie turned around as she screamed and collapsed on the ground. Johnny ran out of the barn yelling, \"Mommy!\" \"Thomas, down here!\" Marie yelled as Thomas looked down to see her under the wooden porch. Thomas then crawled under the porch and hid in the crawlspace. The creature lunged out of the woods and landed right next to the house, burying its claws in the dirt. \"Thomas, do you have the gun?\" Marie asked in a whisper. \"Oh good God, no, I don't have it,\" Thomas replied. They both knew that it was too late now. \"I shouldn't have went out at a new moon,\" he said. \"What are you talking about?\" Marie replied. \"I've seen that thing before, and I saw what it can do to deer,\" her husband whispered. \"It only comes out at new moons, so it could hunt in the darkness.\" \"Well whatever it is, I don't want it doing the same thing to us,\" Marie said. The creature scratched its long, blood red fingers against Johnny's bedroom window as the child whimpered under his bed. Its hand then suddenly broke through the glass as Johnny screamed and ran out of his room. Thomas then saw a long, rusty pole on the ground that was about five feet long. He grabbed it and crawled out from under the porch. He stood up as it started raining. He yelled at the top of his lungs, \"Hey! If you want to take my son you have to take me first!\" The creature lumbered into view. It roared at Thomas as it rushed towards him. The thing's mouth was wide open; this was Thomas' chance to strike. He ran up to the creature and rammed the pole down its throat. The creature twitched and convulsed violently as blood spurted out of its maw. The creature fell on the ground as it let out a pained gurgle."}
{"url": "https://creepypasta.fandom.com/wiki/A_New_Mannequin_Arrived_at_Work", "title": "A New Mannequin Arrived at Work", "author": "TheDarkRemark Content is availa", "publication_date": null, "tags": ["Disappearances", "Items/Objects"], "content": "I work in a store that deals in selling children's toys and clothing. Dotted around the store are a bunch of mannequins wearing either fashionable clothes with children’s characters on them or costumes to be like their favorite characters. Every few weeks, the store changes. Literally, nothing stays in the same place for more than a month. The dolls can take up an entire section of a wall in one month and then occupy a small freestanding fixture the next. This means that the mannequins move around all of the time too. One night, about a month back, we broke two mannequins. Much to our dismay, and our boss's, we needed to buy a couple of new ones. Our boss was livid with us because apparently, those things cost about two grand each. Two fucking grand for a fake kid. Anyway, the two new ones arrived a few days later along with one of our deliveries for the week. I carefully picked up one of the mannequins and took it to where it would be put on display the next morning and asked one of the girls I was pulling the delivery in with to grab the other one. When I returned, I saw she was dragging this other new mannequin across the floor while still wrapped in a protective bag. “What are you doing? Just pick it up, it’s not that heavy,” I said, mockingly. “Oh, yeah? You try!” she said with a wisp of bite to her words. I left a sticky note on the thing saying to install that new mannequin first when the morning team arrived for work and that it would be at least a three-person job due to the weight and the height it needed to travel. I even questioned whether or not our glass shelving would be able to withstand the weight or not on the note. I sent a reply giving them all props for even getting the thing up there. So, he’s cashing up, one of the girls I work with is tidying the store and I’m trying to take this mannequin out of the wall, and fuck me, was I struggling. I couldn’t even detach this thing from its metal holder never mind take it down. “What the fuck?!” we both said in unison. Underneath the mannequin's face was the face of a person. Not just any person… a fucking child. I and my colleague recoiled in horror and she ran to tell the manager. He came over and looked like he’d just seen a ghost. His reaction was the most flamboyant I’ve ever seen come from him. In fact, there were targets listed on his walls. Keep your children safe, people. And next time you look at a mannequin on a shop floor or shop window. Look extra close… it might not just be a big hunk of plastic. Inside could be a whole other level of twisted."}
{"url": "https://creepypasta.fandom.com/wiki/A_New_Life", "title": "A New Life", "author": "this time", "publication_date": null, "tags": ["Beings", "Music"], "content": "So I lived there for a while, driving to my community college by day, going on the internet and eating like a horrible fucking pig by night. It was routine, and I think it's obvious to say that it got pretty old after a while. But there wasn't much I could really do, being an eighteen-year-old working at Walmart and all. \"911 what's your emergency?\" \"I... there's...\" \"I'm sorry sir, can you speak up?\" \"I... don’t...” \"Sir, are you alright, can you tell me where you're calling from?\" \"911 what's your emergency?\" \"I... there's...\" \"I'm sorry sir, can you speak up?\" \"I... don’t...” \"Sir, are you alright, can you tell me where you're calling from?\""}
{"url": "https://creepypasta.fandom.com/wiki/A_New_Day", "title": "A New Day", "author": "FlakyPorcupine Those who cannot", "publication_date": null, "tags": ["Dreams/Sleep", "Reality", "Mental Illness", "FlakyPorcupine"], "content": "You looked down at the murdered body of your best friend, the gun shaking in your hand at the action of it before it slipped off altogether. You backed into the wall behind you, crawling into a fetal position. You reminded yourself that this wasn’t real, this was all a lie. He wasn’t real, nothing was. It was all an illusion, a game that you were not willing to play anymore. And you were met with nothing. You slowly got up from the hospital bed, picking up the family picture you always carried around in your wallet on the desk next to it before stuffing it into your pocket. There is something philosophical about this, you thought crudely to yourself. You tried to think of that ancient proverb, and it depressed you further as it came to you. You walked on. Are you going to be okay, Stanley asked you like he did this every hour, on every day. You stared at the water cooler for a long time before you flipped it onto its side in a fit of rage with a scream, falling to your knees as you cried bitterly to yourself. You sacrificed your life for this, you realized; to escape and refuse to accept your reality. The emptiness that you so selfishly tried to escape from was catching up to you again, filling your mood. The nonexistent walls of this open, grey path felt as though they were closing in on you. Slowly you die – die alone on the inside. To pass from this hell is all you wished. And you woke in a cold sweat from your dream, looking around the dim bedroom with a fright. You tried to recall, but found that you could not remember anything, so you passed it off as just a nightmare. Written by FlakyPorcupine Those who cannot remember the past, are condemned to repeat it - George Santayana"}
{"url": "https://creepypasta.fandom.com/wiki/A_Music_Box", "title": "A Music Box", "author": "her grandmother. She decided th", "publication_date": null, "tags": ["Historical Archive", "Music", "Items/Objects"], "content": "The rest of the afternoon was much of the same: open a box, toss its contents into a ‘get rid of’ pile, rinse, and repeat. She was grateful, though, whenever the monotonous work was punctuated by an interesting discovery. An old piece of jewelry here, a handful of photos there; it was dull work, but it was something to do. She pulled out piece after piece of it. Finally, she could see the object the newspaper was protecting from damage: a music box. She lifted it gingerly from its resting place. It was ornately decorated. Curious, Cam lifted the lid of the box. A tiny, intricately carved ballerina stood on a little pedestal, along with a tiny key, which presumably was meant to wind it. A few minutes later, she caught herself humming the music box’s song. Odd, since she wasn’t normally the kind of person who was prone to humming. Yet, she didn’t stop herself. She kept softly humming the song to herself. There was something soothing about it."}
{"url": "https://creepypasta.fandom.com/wiki/A_Muffled_Curse", "title": "A Muffled Curse", "author": "Unknown", "publication_date": null, "tags": ["Monsters"], "content": "Before this whole mess happened, I was just an ordinary reporter, from Pittsburgh, Pennsylvania. Catching up on the daily news was my life, and I loved it. Finding out what was going on in the world excited me, but the story about to unfold was more news than I wanted. This is my story… It was about two weeks ago when my problems started. On my way to work, I passed a beggar on the street where I live, and he looked up at me expectantly, hoping for some charity. Ignoring him, I strolled past, but before I could go too far, he grabbed hold of my trouser leg and jerked me back. ‘Please…’ he murmured, barely audibly. Pulling myself away from his weak grasp, I said – ‘Let go, I haven’t got any money on me.’ But as he released his grip, coins chinked in my pocket. I reddened and hurried away. As I put distance between us, the beggar started cursing and he whispered something that carried on the breeze. ‘You should take a walk in the woods…’ ‘It’s coming.’ Shortly before I was discharged from hospital, I got the message that my boss was letting me off for a little while to get my problems sorted. This meant – ‘You’re fired.’ So now I’d lost my job to a stupid ghost story. Great. ‘I warned you.’ The only thing I remember is the striking pain as it bit deep into my arm. Then the blackness mercifully claimed me. But I couldn’t be sure."}
{"url": "https://creepypasta.fandom.com/wiki/Creepypasta_Wiki:Deleted_Page_(License_Issues)", "title": "Creepypasta Wiki:Deleted Page", "author": "Unknown", "publication_date": null, "tags": [], "content": ""}
{"url": "https://creepypasta.fandom.com/wiki/A_Mountain_in_Chicago", "title": "A Mountain in Chicago", "author": "HopelessNightOwl Content is ava", "publication_date": null, "tags": ["Places", "Science", "Animals", "3 more", "Nature", "Weird", "HopelessNightOwl"], "content": "It was a positively moronic idea from the very jump. You would expect this sort of thing out of an utterly dysfunctional country like China, but as it turns out we have plenty of morons right here in the US to approve such a thing. Alas, there was no great public outcry, at least not at first. Many people just didn’t believe it was going to happen initially. I talked to one guy at a bar who said he would never believe in “the mountain” until construction actually started. Then construction started, albeit five years behind schedule, and people started getting concerned. The first thing they did was take the poorest, most crime-ridden neighborhood they could find and put it under eminent domain. Like that old computer game SimCity, they just displaced a few thousand residents so they could plop a fake mountain there."}
{"url": "https://creepypasta.fandom.com/wiki/A_Mother%27s_Obsession", "title": "A Mother%27s Obsession", "author": "belonged to her", "publication_date": null, "tags": ["Mental Illness", "Crime", "PotM"], "content": "“ The one there, with the white blanket? ” my grandpa asked her. “ Noooo! That baby isn’t even half as cute as my baby boy! ” The woman was still talking in a playful, sing-songy kind of voice, if that makes sense. She didn’t seem threatening, or creepy, she just seemed like an especially affable new mother. She kept her finger pressed to the window and brought her face up to it so her nose was just touching the glass. “ That’s my sweet, beautiful, amazing little baby boy, right…there! ” “ Is he…right there? ” my grandpa took another guess, pressing his own finger to the window. “ With the Nike hat? ” The woman took a deep breath. She started giddily stamping her feet as if she were overcome with joy. She took her finger from the glass and started clapping her hands together. “ He’s so perfect!!! Isn’t he?! Isn’t he perfect?! ” The baby in the Nike hat was me. “ Ma’am… ” my grandpa said to her, but she didn’t reply. When my grandpa told me the story (this part of which I’ve also heard from my mom separately, nearly verbatim), he said that when they realized she was all effusive over me, a newborn that wasn’t hers and didn’t have any relation to her, the woman didn’t seem delusional or confused, nor did she seem threatening or dangerous. She just seemed like a new mom, albeit an over-excited one. “ Ma’am, ” he said again. “ What? ” she said through clenched teeth. “ He’s mine. And he’s beautiful. You don’t think he’s beautiful? ” My grandpa looked at her and simply said, “ I don’t think he’s yours. “ The woman started breathing heavily, and my mom has described her as looking angrier than she’s ever seen anyone before or since. My grandpa put his arm in front of my mom and guided her backward and behind him, making sure he was between her and the woman. Then, as quickly as she’d flipped from excited to enraged, she calmed down and a warm smile crawled across her face. She kissed the tips of her fingers and pressed them to the glass once again. And with that, she turned around and walked away. Now to where I can (however vaguely) recall for myself. Due to protocol, the office workers obviously did not comply with what the woman was demanding. When one of the workers said they would call my home to get permission to release me (a ruse of course, she was going to and did call the police), the woman responded by saying, “ That beautiful baby boy only has me. He only has me and you’re trying to keep him from me. I don’t know what that beautiful child ever did to you to deserve such horrible treatment. All he wants is me, and you’re keeping him from me. He’s such a beautiful perfect baby boy and you want to hurt him! Shame on you! ” and hurried out of the school with tears running down her face. The very first letter, from my first birthday, was just a generic birthday card with the message “ To the most beautiful baby boy in the entire world. Love, your real mommy. ” By the time I was six, they’d gotten a bit more direct. “ My beautiful, perfect baby boy, I miss you and I love you so much, and I am so, SO angry that they’re keeping you away from me. I love you more than life itself, sweetheart. You are mine. ” I opened the letter I’d gotten the day prior, on my 13th birthday. Another basic birthday card, but by this point the messages were overtly threatening. “ Have a wonderful birthday, my beautiful, perfect, amazing baby boy. They will regret keeping us apart. I know you want to be with me and I know I need to be with you. We are supposed to be together, I’m your REAL mother. I love you. I love you way more than the fakes you live with now. They will regret ever stealing you from me. ” That letter too was taken to the police, but as per usual there wasn’t much to be done. The notebooks were filled front and back, cover to cover, with what were essentially ramblings about a “ beautiful baby boy ” and how he was “ going to be reunited ” with the author someday. They eventually devolved into blatant threats such as “ Everyone who keeps us apart will die. No one will be spared. We will show all of them, all of them who don’t understand us, and we will make them hurt the way they hurt us. ” Investigators spent days removing and logging all of the photos off the walls and ceilings, and even longer transcribing all of the notebooks, which, based on infrequent labellings of dates went back to 1989. June 8th, 1989 specifically. My birthday. STAY AWAY HES MY BABY BOY WHORE “ Thank you for getting rid of that nasty girl. You know I’m the only woman you need in your life, and that your REAL mother knows best. Now all you have to do is get rid of your fake mom and fake grandma and fake grandpa. I’m your REAL family. Your REAL mom. And you’re my REAL baby boy. Nothing will ever change that. I can’t wait until you come back to me. ” It was taken to the police all that, but of course, nothing was done. “ I tried accepting that the world would never let us be together. That they wanted you to stay with your fake family, and now with your whore. But I know thats not true, baby. You’re my beautiful, perfect baby boy, and I know you better than anyone knows you, and I know you need to be with me. I see you every day living your fake life and I know it’s not what you really want. I know your whole life you’ve been told that those fakes are your family, and that they are who you should love, but they are WRONG. I am who you need to love. You are MY BOY. We will be together. No matter what. I promise. I promise I will never let you go. I love you. ” I took the letter to the police, but as always, there’s only so much they can do. Since I learned what was going on, that I was being stalked, I’ve often wondered why I was chosen by this woman to be the object of her bizarre affection. What I do know is that I need to protect my mom, grandma, grandpa, and wife. I’ve been pursued by this woman since moments after I came into this world. I don’t think I’ll ever know why. Credited to Nick Botic"}
{"url": "https://creepypasta.fandom.com/wiki/A_Moonlight_Drive", "title": "A Moonlight Drive", "author": "Unknown", "publication_date": null, "tags": ["Beings", "Dismemberment", "Mental Illness"], "content": "The last time that this happened, Gregory waited. He wanted to know the The children returned from school at about three in the afternoon to end Gregory's deep slumber. He did not need an alarm for they were slamming doors and screaming at one another—as children often do. He cursed the sun, his life, and everything around him as he slowly shut the blinds. He decided to take a shower, as it would grant him a little more time to himself. Should I confront her? Will this ruin our marriage? What about the kids? His thoughts ran around that simple track for what seemed like innumerable days when his mind suddenly returned. A child's scream, preceded by the sound of shattering glass, traveled through the walls and pierced him in his confused state. He quickly shut off the now freezing water, threw on his robe and rushed down the stairs. When woken from the light, Gregory realized that he couldn't move. On a surgery table of some sort, he was held tightly in place by a series of metal bars. Round in diameter, they ran through the table to be locked at the bottom. All was dark again. This can't be true. That's my family! He could not comprehend the meaning of it all. Every moment in Gregory's life was being repeated by this dashing young man, and these photographs were hard evidence that supported it. About five feet to his right, the stranger came to stop. His breathing grew to a constant in-out tempo. Gregory heard a muffled thump and fluorescent lights came on—what he saw disturbed him: A pile of organs lay rotting on the floor. Maggots crawled through the mass of tissue in a lofty manner. They were having a feast. And even though Gregory vowed no religion, he began to pray. To whatever God was up there he begged forgiveness. And it was while he was mumbling to himself in religious ignorance that he felt a slight graze on the back of his neck. The room was dark again. He heard a door just in front of him open, and what sounded like a cage was rolled in. After a brief clashing of some keys, the cage was opened and a hissing sound could be heard. Not too long after, something long and smooth wrapped around Gregory's legs. His entire lower body began to fall asleep. Gregory's wife . The stranger whistled 'Amazing Grace' as he scalped Greg's oldest son. He worked his way down the body, stitching any possible mistakes in the formation of his new coat of skin. When he finally finished, he called the snakes back into their cage. He left the room once more, but this time he did not return. At least not for a while. The flames worked their way into the room as Gregory's youngest daughter regained consciousness. He wanted to speak but could only watch. All he could smell was burning hair as she screamed in agony. His eyes were tightly shut. He did not want any mental photographs to take home, should he survive. He opened his eyes and in the split second before the lights were shut off, he saw a steaming heap of cooked flesh and charred bones where his daughter used to be. He could not cry, his blood was barely flowing. In the darkness again, he now heard voices. Multiple voices, speaking in a language he could not understand. One man pointed to the center of his chest and they all seemed to agree with him something. Gregory grew nervous. His heart began to beat faster. A tall man in the group walked over to the hidden doorway and shouted something inside, then resumed his position in the group. The men then fell to silence. Moments later a woman entered the room. She held a syringe filled with some clear, bubbly liquid. She put the needle to Gregory's heart and pushed. Birds could be heard whistling their favorite tunes as Gregory opened his eyes. Wrapped in clean, warm covers, he welcomed the sound and opened his eyes to the bursting light. The sounds of nature were full & glorious, yet something seemed to be missing. He felt reborn in those first few moments when he realized he was still alive, but now a terrible emptiness filled his mind. He ran about the house checking all the rooms, but found not one living thing. His thoughts once again filled the boundless all. What's happening? he asked himself but found no reply. He stepped out the front door as it began to rain and all was dark once more."}
{"url": "https://creepypasta.fandom.com/wiki/A_Month_of_Rain", "title": "A Month of Rain", "author": "woods", "publication_date": null, "tags": ["Disappearances", "Cryptids"], "content": "The rain is calling... When I say a month of rain, I literally mean it; it would never stop raining. It rained that whole month nonstop, and it was kind of strange since the rain came in unannounced by meteorologists. It was almost similar to that of a hurricane, with strong winds, thunder, lightning, and lengthy periods of rain. It almost came out of nowhere, it just started pouring. The sky went dim and gloomy, the clouds rolled in, the rain fell and it continued for as long as I could remember. The lights continued in the sky every night until eventually there was the loudest thunder strike. At least, I thought it was. I bet it woke the whole town up. It struck somewhere within the woods, and then things got weird. Every night, we’d hear weird noises, voices, whispers, and scratching outside. Sinkholes or burrows could be found all over patios, lawns, gardens, and the woods. The water rose up to our waists, and eventually school was called off on occasion. My friend Finny and some other kids in our clique would visit my house often to play; sometimes, they might even stay the night. I remember this one time, waking up one night and being drawn to the window. We were in our living room, and my other friend Bryce was looking outside the window I felt enticed to look out of when I awoke. He and two other kids were at the window looking outside as if intrigued. They said that someone was calling out to them and inviting them out to play inside the rain. We looked outside and saw nothing. A few minutes passed as we continued to look out the window, feeling strangely enticed to go outside. Eventually, the rain hit harder, and it also appeared that something was swimming in my flooded back yard. It never emerged from the water to show us its identity, or what it was. We just assumed it was the rain making weird patterns in the water as it hit it. The urge to go outside remained, and we began hearing whispers again. They usually ranged from “Come outside, it is safe,” or “Come play with us.” Most of what someone would say to convince a child to come out of a hiding spot. The town was mortified, and eventually a town meeting was called. Some of my friends were missing too, and all that was left of my clique was Finny and Dalton. We waited outside the courthouse with my mom as it went on. I remember asking about what they were talking about, but my mother would always avoid telling me usually by saying “Some very boring stuff grown-ups talk about dear,” or “You’re too young, you wouldn’t understand. Plus you’d probably fall asleep, it’s pretty long honey.” I remember the night before the evacuation, exactly one day before the month finished. I live next door to Dalton, and it was the night I saw them leave. The lights didn’t even go on; they sort of just went out of the house, leaving everything behind. They didn’t bother to lock the door, they didn’t bother to pack, and they didn’t bother to change clothing. They left their front door, and they walked into the woods. I was assuming they were taking a shortcut, but I still found it pretty strange. It was drizzling a bit as they left, and the rain was beginning to die down. I started hearing whispers again, only much louder. I looked out of my window and looked at the flooded streets. I saw strange patterns in the water again, and as if it was trailing a moving object under the water. I remembered that there was a crazy person stealing children at night, and decided to close my curtains so that no one could see into my room. Then the clawing and scratching began. The whispers and scratching never left, and I was surprised I even fell asleep. We did as we were told, and stood in the muddy and murky waters. We began to hear faint whispers again, and felt soothingly relaxed. The feeling was ominous, and it persisted for the duration that we spent waiting for our mothers to return. I remember tripping into the water, or so I thought, until I couldn’t seem to stand up. I panicked when I felt a force pulling me into the water, and as I heard Finny’s panicked screams. I felt a hand grab tightly onto my shoulder, and pull me to the surface."}
{"url": "https://creepypasta.fandom.com/wiki/A_Moment%27s_Clarity", "title": "A Moment%27s Clarity", "author": "Unknown", "publication_date": null, "tags": ["Historical Archive", "Weird"], "content": "Anita was uncomfortable, and then she hung up. She put entirely too much sugar in her tea and shivered as she drank it. She did miss her husband. Sometimes. And now she would have to trim her own lawn. Her first hint that something might have been a bit off was when she found her neighbor, frozen solid while pulling the weeds in his yard. The next day, while shopping for groceries the bag boy, with a crackle, transformed, still clutching her biscotti. She tenderly wrenched it from his grip, glanced around halfheartedly, and didn’t pay. Then the news reports began to get very tiresome. First it was strange, isolated events. Then it was an epidemic, then a pandemic, and then it was Susan Shepherd reporting to you live from New York City and…crackle. Suddenly, she wasn’t reporting. Suddenly, she wasn’t even alive. At first, she’d gotten dozens of calls for funerals of her husband’s mother, friends, old boyfriends, but soon even the funerals died off. There were too many to throw. “Hello,” she said, wiping sleep from her eyes with one hand and holding a candle in the other. “Attic’s that way.” “I’m going to have some tea,” she said, and began walking slowly away. Roland’s mind reeled for a moment, and then he set off for the attic. In the kitchen, Anita sleepily sipped Earl Gray when Roland trudged down the stairs with a sack over his shoulder and came upon her. He stopped mid-step and looked at her carefully. “All those people up there…” “The glass ones?” Pause. Sip. “Yeah, the glass ones,” “What about them?” “Why did you-” “Think of it as a sort of a tomb.” Roland decided he’d stay. Anita mistrusted him at first but soon found it was a great relief just having him around. She was running low on food and it really was lovely to have someone to break into a grocery store with. As much as she knew how low the chances were of her finding anything dangerous, the lonely streets seemed much less so with a companion. He tended the garden, collected rain water for drinking and bathing, and even sometimes sat with her by the fireplace, sharing a seemingly endless stockpile of tea with her, “We’re going to run out of food, you know.” Roland mentioned. “Even just between the two of us, there’s only so long that that store will hold out.” Roland shrugged. “I don’t know. Leave?” Anita didn’t answer. Their lives became a long journey from food source to convenience store to market to people’s basements, sleeping when they could and traveling as they pleased. They took what they needed, carried what they could, and moved on. Roland led them, taking to this life with complete ease. As they walked, he shouted things back at her like “Lovely, isn’t it?” and she never answered. He found her silence unnerving. “I’ve been thinking, Anita,” Roland said gently, “that the world ended.” She shattered as she hit bottom."}
{"url": "https://creepypasta.fandom.com/wiki/A_Moment", "title": "A Moment", "author": "Unknown", "publication_date": null, "tags": ["41488p-fduser", "Animals"], "content": "She chuckled a bit, and whispered to the Baron, \"Why, with meat, of course!\" But the English did not let up on their siege. Raids into the town became more common, and the Baron once again saw the need for another feast. And so he put his best minds of the castle together to create a mixture of some sort that, when cooked, would resemble meat. Eventually, they came up with the mixture, and the Baron went to work on the feast yet again. \"Have you tasted meat, Baron Vanier? It simply cannot be recreated in a bottle of liquid! One must have the meat in his hands to create a dish with meat.\" \"Then find some,\" she replied."}
{"url": "https://creepypasta.fandom.com/wiki/A_Modest_Proposal", "title": "A Modest Proposal", "author": "Unknown", "publication_date": null, "tags": ["Suggested Reading", "Historical Archive/PD"], "content": "A Modest Proposal by Jonathan Swift (1667-1745) For Preventing the Children of Poor People in Ireland from Being a Burden to Their Parents or Country, and for Making Them Beneficial to the Public But my intention is very far from being confined to provide only for the children of professed beggars: it is of a much greater extent, and shall take in the whole number of infants at a certain age, who are born of parents in effect as little able to support them, as those who demand our charity in the streets. I am assured by our merchants, that a boy or a girl before twelve years old, is no saleable commodity, and even when they come to this age, they will not yield above three pounds, or three pounds and half a crown at most, on the exchange; which cannot turn to account either to the parents or kingdom, the charge of nutriments and rags having been at least four times that value. I shall now therefore humbly propose my own thoughts, which I hope will not be liable to the least objection. I have been assured by a very knowing American of my acquaintance in London, that a young healthy child well nursed, is, at a year old, a most delicious nourishing and wholesome food, whether stewed, roasted, baked, or boiled; and I make no doubt that it will equally serve in a fricasie, or a ragoust. I have reckoned upon a medium, that a child just born will weigh 12 pounds, and in a solar year, if tolerably nursed, encreaseth to 28 pounds. As to our City of Dublin, shambles may be appointed for this purpose, in the most convenient parts of it, and butchers we may be assured will not be wanting; although I rather recommend buying the children alive, and dressing them hot from the knife, as we do roasting pigs. Some persons of a desponding spirit are in great concern about that vast number of poor people, who are aged, diseased, or maimed; and I have been desired to employ my thoughts what course may be taken, to ease the nation of so grievous an incumbrance. But I am not in the least pain upon that matter, because it is very well known, that they are every day dying, and rotting, by cold and famine, and filth, and vermin, as fast as can be reasonably expected. And as to the young labourers, they are now in almost as hopeful a condition. They cannot get work, and consequently pine away from want of nourishment, to a degree, that if at any time they are accidentally hired to common labour, they have not strength to perform it, and thus the country and themselves are happily delivered from the evils to come. Thirdly, Whereas the maintainance of an hundred thousand children, from two years old, and upwards, cannot be computed at less than ten shillings a piece per annum, the nation's stock will be thereby encreased fifty thousand pounds per annum, besides the profit of a new dish, introduced to the tables of all gentlemen of fortune in the kingdom, who have any refinement in taste. And the money will circulate among our selves, the goods being entirely of our own growth and manufacture. Fourthly, The constant breeders, besides the gain of eight shillings sterling per annum by the sale of their children, will be rid of the charge of maintaining them after the first year. Fifthly, This food would likewise bring great custom to taverns, where the vintners will certainly be so prudent as to procure the best receipts for dressing it to perfection; and consequently have their houses frequented by all the fine gentlemen, who justly value themselves upon their knowledge in good eating; and a skilful cook, who understands how to oblige his guests, will contrive to make it as expensive as they please. Supposing that one thousand families in this city, would be constant customers for infants flesh, besides others who might have it at merry meetings, particularly at weddings and christenings, I compute that Dublin would take off annually about twenty thousand carcasses; and the rest of the kingdom (where probably they will be sold somewhat cheaper) the remaining eighty thousand. Therefore I repeat, let no man talk to me of these and the like expedients, 'till he hath at least some glympse of hope, that there will ever be some hearty and sincere attempt to put them into practice."}
{"url": "https://creepypasta.fandom.com/wiki/A_Mission_on_Lake_Ontario", "title": "A Mission on Lake Ontario", "author": "HopelessNightOwl Content is ava", "publication_date": null, "tags": ["HopelessNightOwl", "Dreams/Sleep", "History", "4 more", "Military", "Nature", "Places", "Wheel of Misfortune 2022"], "content": "Author's note: This is my entry for the Wheel of Misfortune 2022 writing contest. My challenge was to write a story set in a combat environment. When war broke out again with Britain over the Indian territories in 1812, he left the university to join the New York militia, where he was commissioned to the rank of Captain at just 20 years old. He was given command of a company of some sixty men, and ordered to march to Lake Ontario, where he was to establish a fort to prevent British amphibious incursions. The land Captain Saxon chose for his new fort was poorly suited to the purpose. He selected a low clearing surrounded by woods about a quarter of a mile from the lake. The ground was permanently moist and rocky, and the clearing itself was barely spacious enough to hold a small post. The mosquitoes were a terror. Captain Saxon named the post Fort Kant. His mission was to watch for British patrols, but there was never any sign of the redcoats. He turned his focus to the matter of shoring up his garrison's provisions for the coming winter, sending out foraging parties and excising supplies from local farms. They eventually planted a vegetable garden. Daniel took to meditating in the evening down by the lake. Sometimes he would see a warship, but never any land forces. Now and again he would drill the men, but that quickly became tiresome. He soon felt his assignment was pointless. The prisoner was housed in a tent within the fort and an extra section of fence was put up to sequester him from the rest of the garrison. Two militiamen guarded him at all times and he was not to speak to the other men. Sawill's only last request was a Bible. His execution was delayed a few days for a supply party to find one. The best they could manage was an old hymnal, found at a nearby farm. When it was time to muster in the spring, some men did not report back, and there were a few new faces. Despite not having a complete complement of troops, Daniel received orders to abandon Fort Kant and march east toward the new front at Lake Erie. He was to join with a company of regulars where a new fort was being built. They took what supplies they could carry and buried the rest. There was no time to demolish the fort, as his orders were to depart immediately. Having slept a few hours, they decamped just before dawn. Saxon diverted his course somewhat, but his next destination remained the same: a frontier town en route to the site of the new fort. There they would commend the wounded militiaman to the care if the townspeople, rest, and resupply. The minister merely nodded. Daniel wanted to ask if he himself believed in God, as his face left him unsure. Their conversation ended with the minister inviting Daniel to service the next day, and him declining. Some of his men did attend, and when it was finished, they formed up and began the next leg of their journey. He gazed over the lake. Not a vessel in sight, but that meant nothing. Greenwald privately intended to surrender or abandon the fort if the British won the expected upcoming naval showdown, regardless of his orders. His quartermaster ran up the hill where he was perched, informing him that somebody was approaching the fort by horse. The major could see him from there, clearly an inexperienced rider, bolting up the path like a drunk lunatic. Greenwald cursed. Not only would his reinforcements not arrive at all, but there were Indians about, and bodies to recover out there. He wanted to literally shoot the messenger. Barely able to contain himself, he sent as many men as he could afford to the scene of the massacre. They brought back as many bodies as they found, but Captain Saxon's was not among them. Late October, 1814 For Colonel Silver, these were all things he'd heard before. But for Major Bowers and the other officers, they portended a revolution. The Colonel decided to speak to Saxon himself. He arrived at the fort one Saturday, the rangers hiding about in the woods in case of an emergency. Image sourced from Wikimedia Commons"}
{"url": "https://creepypasta.fandom.com/wiki/A_Mind_Writhing_in_Agony", "title": "A Mind Writhing in Agony", "author": "Unknown", "publication_date": null, "tags": ["Diary/Journal", "Mental Illness"], "content": "For days I suffered through constant screaming, and insults, anger, frustration, confusion, I laid upon the floor and just covered my ears for days, screaming out to the air where none could lift me from this pain and agony. Today I still feel the voices.... They're yelling into my skull even at this very moment. They speak to me about the woman in my dreams. I have seen her. Almost all of my dreams were always about her. She was of unparalleled beauty. She always smiled. She didn't dawn a big smile in my dreams. But it was a smile that you could not help but smile along with. She never spoke. She only smiled and looked into my eyes. I always felt as though I recognized her but I could never figure out who she was. It was frustrating. Until the voices came."}
{"url": "https://creepypasta.fandom.com/wiki/A_Mile_in_His_Shoes", "title": "A Mile in His Shoes", "author": "investing into utilities. A mer", "publication_date": null, "tags": ["Doom Vroom", "Items/Objects", "Videos"], "content": "The restaurateur ceased stroking his feathery beard and moved on to rubbing his bald dome in contemplation as he momentarily gave a confused look. “You don't sound right, Mr. Laurie. You might be coming down with a cold or something, best be careful. Last thing you need is to catch pneumonia and make them rumors a reality. Tell me what you want to eat and I'll get it whipped up and you fixed back into shape!” “I'll have a hamburger with coffee.” “Yeah,” came Jason Marlow's terrified reply. “You sound a lot better! I hope you enjoyed your meal. Thanks for buying the diner and keeping us afloat, boss!” The attempted dine and dasher internally smacked himself. Save for the walls, floor, and the door that hung at the opposite end, the front room was entirely bare. Despite the trepidation, Marlow carried himself across the empty room, his footsteps echoing throughout. Shakily, he reached out an arm and flung open the door to reveal a rail-less stairway. The split second his feet came to rest on the first step, his brain instinctively knew that there was no turning back. With each successive step ascended, Jason Marlow became more confident. By the time that he reached the final floor, he was a different person entirely. Christoph Laurie threw open the door to his former office. A scrawny, well-dressed, glasses-wearing man, who might match most people's imagery of an accountant, looked up from the chair in which he was seated. The seat-warmer's eye's bulged with fear from behind their frames when he registered the man that stood before him. The retired judge slowly strolled into the room, relishing the other man's fear which practically lingered through the air. “Mi-Mister Laurie,” the seated man exclaimed as he rose and slowly backed up into the large window behind him. The business owner cracked his knuckles, continuing to edge toward the room's other occupant, and replying, “I don't like to leave my work unfinished.” “That makes two of us,” exclaimed Heywood with a shrill cry as he reached into a pocket underneath his jacket and retrieved a small pistol. A tiny funeral procession was held in honor of Christoph Laurie, even smaller than the last. No one paid any attention to the body on display. A man and woman were off to the side chatting, a well-to-do married couple. Their discussion was one that everyone present was having with each other. “This is the fourth time, Joel!” “Martha, I swear this is the last of his funerals we'll go to. Regardless of if this body ends up not being his.” “At least the first one they buried looked like him! I've heard that two of the times they exhumed his grave, the bodies didn't even look similar!” “It's so peculiar. The person on display at every funeral looks exactly like him and we've seen them buried. It's almost like someone is swapping bodies as a cruel joke.”"}
{"url": "https://creepypasta.fandom.com/wiki/A_Midsummer_Night%27s_Scream", "title": "A Midsummer Night%27s Scream", "author": "Unknown", "publication_date": null, "tags": ["Beings"], "content": "Where I lived is also relevant. My house was a typical middle-class, suburban, two-story home at the back of a cul-de-sac. My room is above the garage with a great view of our big back yard. There’s a little roof outstretching from right below that window and oftentimes in summer I would sit on the roof at night and watch the stars. About a minute, maybe less, passed and that’s when I saw them. The first came bursting through a canopy of trees at the edge of the creek. It was a figure, definitely male, running through the tall grass of my backyard, sprinting. It looked as if he was running for his life. Shortly behind was another figure, seemingly male, about the first figure's height following him, running directly behind him and quickly shortening their distance apart. As quickly as they appeared in the tall grass, they disappeared from my view just as quick. I ran downstairs to see if I could better see what was going on from my patio doors. As I got to the doors I heard a final yell, but this time the yell lasted for maybe a half a second, and sounded like it was cut short. I assumed the worst. I slowly began to back away, however, when I did that all I could make out in the darkness was it raising its arm and waving at me. It did see me. I was sure of that now. Horrified, of whatever it was or whoever it was, I ran to my room. I shut my window immediately, closed the blinds and then proceeded to turn on all the lights in my room, watch every last stupid infomercial that was on TV and call everyone in my contact list to try and calm me down. I didn't sleep until the next afternoon. As my parents awoke the next day, I told them what I saw but left out the part of the figure waving at me, as not to frighten them. The most terrifying part of the whole ordeal, however, was not seeing the body. The thing about that night that rattles me to my core, the one image that has since been burned into my brain and haunts me on that occasional night, was when I ran upstairs right after it waved to me. I shut my blinds, turned on the lights and watched TV all night. But there was one last moment, where I cracked open my blinds, just to see if dawn was approaching. As I peeked out I saw someone standing on my roof, outside my window with his eyes as close to the glass as possible, just staring at me. Watching me. I will never forget those eyes, those twisted, bloodshot, yellow eyes."}
{"url": "https://creepypasta.fandom.com/wiki/A_Midsummer%27s_Nightmare", "title": "A Midsummer%27s Nightmare", "author": "him", "publication_date": null, "tags": ["Dreams/Sleep", "The Vesper's Bell"], "content": "“Bucklesby sells a random hodgepodge of forgeries and idolatries of questionable provenance and reliability to anyone who walks through his doors,” Mothman reminded him, a defensive edge cutting into his raspy, tinny voice. “I am a purveyor of nothing but genuine preternatural artifacts with well-documented attributes, and my showroom and auctions are by invitation only, available solely to carefully vetted occultists. You’ll find no monkey paws or mogwais here, Chamberlin.” “It’s Ivy’s and Envy’s problem now, is what it is, and I’m not even sure what they’re trying to do with the Sand,” Seneca said dismissively. “I do. They’re trying to fix your mess,” Mothman reminded him. “Not a problem, Mr. Crowley. I’m always happy to accommodate the specific needs of my valued patrons,” Mothman nodded. “And in your case, I’m certain I’ll have no problem telling who the speaker is.” “Frauleins! Frauleins!” Raubritter barked, rudely gesturing to a pair of young waitresses holding sterling hors d’oeuvres platters. They each politely excused themselves from the guests they were serving and moved across the room as quickly as they could without risking losing their cargo. “Yes sir? Something from the bar? Or would you care to try some seafood hors d’oeuvres?” the blonde one asked with a painfully fake smile. “There’s baked clams, crab cakes, salmon puffs, prosciutto-wrapped shrimp, lobster stuffed mushroom caps, caviar on bruschetta –” “Nein! Nein! Nein!” Raubritter cut her off with a swift chopping motion of his hand. “Due to elements of Rabbinical alchemy used in my transmogrification, I can partake of nothing Leviticus condemns as an abomination!” “The… salmon and caviar are Kosher, sir,” the dark-haired waitress said tentatively, gently holding her platter out towards him. Raubritter responded with a cold stare through his tinted, hexagonal spectacles before turning to face his host. “Meremoth, please to be explaining the Aryan and Oriental Frauleins here,” he demanded. “Why are you not using Pascal’s girls?” “Because the Darling Twins have been worse than usual lately and Pascal’s not willing to let their staff work at any venue where they might show up,” Mothman explained. “They’re not coming here tonight though, are they?” Crowley asked in alarm, wheeling back slightly and quickly checking to see where the exits were. “They’re not invited, and I’m not auctioning off anything of theirs, but if they do show up you know the protocol,” Mothman replied. “Never mind the Darlings, Crowley. Raubritter raises a good point,” Seneca interjected. “This is an exclusive event of the Ophion Occult Order, and Mothman was just going on about how carefully vetted his guests were. What about your staff, Meremoth? Where exactly did you pick up these two-bit strumpets?” “Was it the cluster of ganglia wrapped in the prehensile nerve fibers?” Raubritter asked. The dark-haired girl responded with a squeamish nod, reluctant to even speak of the incident. “I’ve run into that Unmensch before as well. Most unpleasant, and quite obviously Crowley’s handiwork.” “And why is that? Because it’s a brain monster, you automatically associate it with me?” Crowley demanded, shaking around furiously inside his vat. “I take supreme umbrage to these specious allegations against both myself and my prestigious body of work!” “What are your names, girls?” he asked. “Halcyon, sir, and this is Emma,” the blonde girl replied. “Halcyon? That’s a ludicrously pretentious name,” he scoffed. “Seriously? My name’s pretentious?” she hissed softly through clenched teeth. And Emma knew that Halcyon wasn’t one to tolerate disparagement from anyone. “Everyone calls her Halcy, sir,” she said with a nervous laugh, stepping in between them to prevent the situation from escalating. “I apologize for her disrespectful comment, but we’re just new to this and still a little confused by your Order’s… distinctive customs. She just thought that her full name might fit in a bit better around here. But Mr. Mothman was right; we’re not daughters of ancient and arcane bloodlines, so Halcyon is probably a bit pretentious for day-to-day use. We’ll take care not to step out of line like that again; I promise.” “Sorry,” she muttered, averting her defiant gaze away from Chamberlin. Seneca cast a questioning glance towards Mothman, who merely shrugged in response. “If you want me to throw her out over that then you’re going to have to explain to my guests why we’re short-staffed this evening,” he said. Groaning in resignation, Seneca swallowed his bile and let the insult slide. “So then, Halcy, that incident in the Cuniculi was your only encounter with the paranormal before meeting Mothman here, was it?” he asked. “ Mm - hmm ,” Halcyon hummed without opening her mouth. Chamberlin continued to eye Halcyon suspiciously. He was certain she was lying, but without anything concrete to support his intuition, he could do nothing without causing a scene. “Very well. Off with you then,” he said with a dismissive wave of his right hand while using the left to snatch a salmon puff off of Halcyon’s platter. The girls bowed politely, and resumed their rounds of distributing hor d’oeuvres and taking drink orders. “Why’d you have to back-talk him?” Emma whispered as soon as they were out of earshot. “It slipped; I’m sorry,” Halcyon apologized. “He’s just such an asshole. Strumpet means prostitute, right?” “You could have ruined everything,” Emma reminded her. “Just hold in there until the auction starts.” “I will. Don’t worry,” she promised. Making sure that no one was watching, she pocketed one of the crab cakes, feeding it to the crimson-eyed black rats that were nesting in her dress. “Almost showtime, little guys.” “Four hundred and twenty thousand!” “… four hundred and twenty thousand. Thank you, Professor Crowley. Can I have four hundred and forty thousand, please? Any bids for four hundred and forty thousand?” “Seems impractical, no?” Raubritter mused as quietly as he could, leaning as far away from Crowley as possible. “Only yields a few drops of blood at a time, yes? And if you hang it upside down, it does not work as art, I think. Too confusing to look at. Just blasphemy for the sake of blasphemy. Senselessly provocative. And again, with the Rabbinical alchemy in my veins, satanic powers are best avoided. I will pass on this, I think.” She noticed him staring at her, and responded with a smug and sinister smirk before she began softly mouthing words at him. “Red Ruck, run amok, crowned the Regent Red. Eyes aflame, soul untamed, come join me in my bed!” She, and likely Emma as well, were followers of the Regent Red. But the sickeningly familiar melody of a flute robbed him of all courage and froze his heart solid. The auction house immediately fell silent, everyone turning every which way to locate the source of the intrusively whimsical sound, eventually spotting Red Ruck sitting in the rafters above Seneca. Ruck ceased playing his flute, and looked down at Mothman with a wide and menacing smile. “Are you going to let him speak that way to your ‘welcomed guest’, Meremoth?” he asked. “I am not Nazi, I am Prussian!” Raubritter objected. “And I am not Kosher, I am cursed!” “You! You did this! You summoned him here!” Seneca spat. “Mothman, I saw her mutter his name! She lied! She’s one of his followers! They both are!” The scourge was real enough to draw blood, it seemed. Before he could get up, Ruck leapt down upon him from the rafter and pinned him down with his clawed foot, the weight of his netherous form making it difficult to breathe. “Alas, my issues with this coward tonight go beyond his indiscretions against my fearsome Halcy,” he announced. “He’s tried to have me murdered, for no other reason than carrying out his justly decreed punishment. He’s gone and offered me up to Emrys as a sacrifice!” “Goddammit, Samantha!” Seneca cursed under his breath. Now the size of dogs, more of the nightmare creatures formed a perimeter around the room. Circling the crowd as they flew through the air, the swarm herded the guests into the center, hissing and snapping at any who tried to escape. “How – how are you doing this?” Seneca stammered in terrified disbelief. “How are you bringing your nightmare creations into the waking world?” “You don’t need to know how, Seneca. You only need to know that I can,” Ruck smiled. Raising his clenched fist into the air, he imploded the glass of the windows inwards, revealing a forest of charred trees and crimson fog on the other side. Halcyon and Emma hopped onto two other members of the swarm as they all gave chase, with Ruck himself bringing up the rear. “Be sure you pay both of them for the full night, you hear me Mothman?” he shouted over his shoulder as he vanished out the window. “I’m sure you’ll agree that such a pittance isn’t worth losing any sleep over!” “Ruck! Ruck! I’m sorry! I’m sorry I offered you to Emrys!” he cried out. “End this, and we can work something out. I’ll get you anything you want! Anything I –” “Stop begging!” Ruck shouted into his face as he perched onto the opposite side of the crown. “Stop bargaining! Even with your life actually on the line, you’re still too pathetic to fight back!” “How am I supposed to fight off dream forms in the waking world!” Seneca demanded. “Halcyon did it!” Ruck shouted back. “A mortal girl not even one-tenth your age, with none of your skill or knowledge of the occult, fended off and then tamed the creatures that hunt you now! You have no excuse, Seneca! I weary of your cowardice. This is your last chance, you hear me? If you do not fend off the wolves this time, it’s your real body that will be torn to shreds. You fight, or you die.” “Your ceremonial serpentine sabre. You really should carry it on you rather than leaving it down in your ritual chamber,” Ruck chastised him. “These are dangerous times for the Order. You never know when you might need to defend yourself.” Seneca jumped to his feet and pulled the sword from the earth. Screaming, he swung it wildly as he charged towards Ruck, who effortlessly vanished into thin air before he was able to make contact. The seven demon-winged ravens above him broke out into a cacophony of cawing, the nearby wolves howling in return, so close now that Seneca could hear them crashing through the thicket. Terror-stricken though he was, he retained enough presence of mind to know that Ruck didn’t have the ability to cast living nightmares into the waking world unaided. The ravens above him, and the wolves closing in around him must have some type of physical body to support their dream forms. There must be some type of living creature hidden beneath the nether, and that was what he was actually fighting. More importantly, that was something he could actually fight. “No!” he heard Halcyon shout from above. The rest of the wolf pack skidded to a stop, suddenly reluctant to come any closer, while the ravens shrieked in outrage at the maiming. “Rats?” Seneca murmured incredulously, holding the struggling rat up to his face in morbid curiosity, utterly bewildered as to how it was still alive. “They’re all just rats?” “Satisfied, Ruck?” Seneca screamed to the trees around him. “You and your minions might be indestructible in a dream world of your own making, but once you set foot in the real world you are Regent of nothing, you hear me? Nothing! Your girls and your rats are subject to the same natural laws and physical limits as anyone else, and I’ll not hesitate to do to them what I’ve done to this blighter here if you ever try something like this again!” Heedless of his threat, Halcyon leapt down from her mount, her scourge raised in heated anger as she moved to strike. “No!” Ruck shouted, materializing behind her and holding her back. “It’s over! Seneca, it’s over. You’ve met my terms; you’ve won. Congratulations. Hand the rat over to Halcy, and we’ll be on our way.” “It’s all over, Ruck! You want this furball back? Then swear on the River Styx to never again haunt my dreams; to never enter my mind, abduct me to your realm, or attack me in the waking world.” “I… I swear on the River Styx, that if you return that rat to us, the Nightmare Realm and its subjects will never trouble you again,” Ruck sighed. But that could wait. For the first night in a long time, Seneca was finally going to get a good night’s sleep."}
{"url": "https://creepypasta.fandom.com/wiki/A_Message_to_the_Girls_at_r/gonewild", "title": "gonewild", "author": "a guy after a short month. He w", "publication_date": null, "tags": ["Reddit Pastas", "Computers and Internet", "Mental Illness", "NSFW"], "content": "A friend of mine saw me perusing through the pages of nude girls and her face went white. I asked her what was wrong and she told me a seriously disturbing story. In her words, this is it: By accident, I discovered reddit and, not long after, /r/gonewild. At first, I only looked. I envied. I wished I could have that attention. I craved it. I decided that was what I wanted. I could be whoever I wanted to be. They asked me to show more skin. They called me beautiful and listed in detail things they wanted to do to my body. I couldn't wait a whole week this time. My third post was only two days later. A shot of my uncovered breasts. He said: “Someone so gorgeous deserves someone worthy of her.” It stood out because it wasn't a dirty comment. It was sweet and innocent. I thanked him. I replied with: “You wouldn't if you knew me.” His reply was strange, but I thought nothing of it. “But I do know you.” I laughed it off. “I meant in real life.” His reply was a link to a picture. I clicked it and my heart stopped. It was me at the mall, looking through lingerie. How did I not notice someone watching me? I wanted to call the cops, but I felt as though I’d brought it on myself by posting on the internet. I needed to find out how he found me. I must have left some clue in my pictures. I went though them, one by one. I couldn't find anything. Then, I saw it. In every picture, on my right hand, my class ring. He knew what college I went to because of my class ring. I wondered if he was also a student. What if he was near me all the time without me knowing? She came back. I was so grateful. She unlocked the door and let me back in, locking it again behind us. She then called the police. I contacted the police department and told them about the new message. They took note of it and said the officer would be on my block again that night to keep me safe. What about during the day though? How was I supposed to go outside? I weighed my stalker’s options. Left led to the lunch quarters and right led out to the main office and visitor parking. Assuming he wasn't a student, I went right. I ran. I reached the parking lot and saw a car leaving. I didn't know that it was my stalker, but I memorized the license plate and saved it in my phone. After that, I went to the front office and asked to speak with security personnel. I didn't answer as always, but this time, he kept going. “I love those little black panties you’re wearing.” I was wearing black panties. I was frozen with fear. “You know that sexy little yellow dress in your closet?” “It smells nice.” I bolted out of the room and grabbed my purse, whipping out the gun. I fumbled to turn off the safety. He was in my closet. I went back to my room and ripped open the closet door and fired. I managed to blow a hole in the back of my closet wall as well as make my ears ring worse than I thought possible. Since he couldn't text me, he would have to find another way to contact me. And he did. He started another Facebook account. This time it was a guy named Chance. Someone also from class. “You’re cute. I was wondering if maybe you’d like to go out for drinks sometime?” I knew it wasn't Chance. Chance was gay. But I sent back: “I would love to. What place did you have in mind?” He told me to meet him at a bar on the North side of town. It was an old bar and it didn't get a lot of business. There would probably be no one there. I told my brother and he let the police know, just so my stalker wouldn't see me communicating with the police. I drove to the bar and stood outside in my yellow dress. I was a bright splotch in the darkness. I could barely breathe. A car pulled up next to mine. It was a shitty navy blue Ford Probe. I waited, holding my breath. No one got out. At the last second, he reversed and peeled out of there pretty fast. The undercover cop parked across the street sped after him. They caught him. Do you know who tortured me all that time? Do you know who ruined my life all because of some naked pictures on the internet? A fucking kid. He was a sixteen year old dropout who spent all his time fapping to his computer screen. When he saw my class ring and realized I was so close, he became obsessed with having the real thing. I still have nightmares because this fucked up little brat couldn't get some. Credited to OwlBeThere"}
{"url": "https://creepypasta.fandom.com/wiki/A_Memory", "title": "A Memory", "author": "myself", "publication_date": null, "tags": ["Historical Archive", "Beings", "Dreams/Sleep"], "content": "When thinking back to my earliest memories, nothing is concrete. A string of hazy images come to mind like random snapshots out of time, each one associated with certain feelings and emotions. They are imbued with a mystical dreamlike quality, a gift born of childhood naivety. The magic of every Christmas when Santa was still real, for example, is an experience of pure joy that is lost with maturity. I don’t think so. Sure, I have memories of distant dreams, but there is a clear distinction between the dreams and reality of my past. I don’t know how I can tell, I just can. And for this reason one memory has always troubled me. The experience was so surreal, and yet certain details stand out with marked clarity. I also remember my brother telling me about a weird dream the next morning. He’d dreamt of a woman who lived “under the floor” and came out at night to play in the rain. When her clothes got soaked, she went back inside and would whisper things to anyone who was sleeping. It became a recurring dream for him until our family moved out of that house. Strange, what the brain chooses to remember. Credited to alapanamo"}
{"url": "https://creepypasta.fandom.com/wiki/A_Measure_of_Greatness", "title": "A Measure of Greatness", "author": "Unknown", "publication_date": null, "tags": ["Diary/Journal", "Mental Illness"], "content": "Question: How do you let people know about something great you've done, if doing so will get you in trouble? 1 December 5th 2 December 6th 3 December 8th 4 December 12th 5 December 15th 6 December 25th This isn't the first time I've seen someone else hurt, but this was by far the worst injury I've ever seen. I don't know why it fascinates me to see them in pain. I often wonder if they are pretending it hurts. Logically it doesn't make sense, but it's hard to imagine anything else. They just aren't as real as me. Which is an excellent segue to my next point. Dr. \"Steve,\" who, for reasons known only to himself, believes me incapable of pronouncing his real surname Streibach, has not gotten any closer to diagnosing me. He still believes I lie on the autism scale and might have Obsessive Compulsive Disorder or possibly Oppositional Defiance Disorder. I enjoying playing games with him. Sometimes I'll close the door to his office an odd number of times, counting, other times I leave it slightly ajar, as if I forgot altogether to close it. It's very funny to watch him scribble notes about it. It was an exceedingly wise decision to keep two separate journals. Mother no longer asks what I'm writing, as I often leave the decoy journal open or unlocked. I've been copying the entries from a site online and changing the names and dates to fit my life. I want my parents to leave me alone and yet I crave their attention. I don't know why. I don't know if this is normal or if I want it to be normal. This portion of my daily writing relates to the entry on November the 29th. As I mentioned earlier, we have mice. This is no doubt due to my stupid younger sister, Samantha's inability to get food in her mouth. When I was 18 months old I could eat perfectly well. But I digress. We have mice, and after much cajoling, screaming, begging and tantrums, I managed to convince my parents to use \"humane\" mouse traps, i.e. traps which merely capture the mouse alive as opposed to killing it. They actually thought it was promising, assuming that I was somehow troubled by the prospect of killing the mouse. The truth, of course, is that I wanted to experiment on the mouse. As I have mentioned in several entries, I desire to be a scientist, probably in biological sciences. My idol was Louis Pastuer, though that may be changing, as I will explain below. A mouse was caught in a trap under the basement steps. I found him before Father got home and stole away with him to my room. I want to know if his pain is real, or if it's something pretend. I've designed an experiment to do this and am excited to begin first thing tomorrow. Dr. Streibach wants me to sit through another I.Q. test. He thinks I \"gamed\" the last one. He asked me about it during my session today. He said, \"Richard, why didn't you try your hardest on the test I gave you last month?\" I told him, \"I did, Dr. Steve. It was really hard.\" \"I know you're smarter than this test shows. I want to talk about the letter C today,\" he said. \"But you didn't mark all of the answers C,\" Dr. Streibach observed. I was unable to write yesterday as I was too busy with my experiment. The mouse, which I named Samantha, for obvious reasons, was an interesting subject. I was not aware until yesterday that they could vocalize. Samantha vocalized extensively, much like the real Samantha, however, I found mouse Samantha's vocalization more pleasing as I controlled it. I won't go into minute details of my experiment (I've entered them into a \"Lab Notebook\" hidden in the usual place), but suffice it to say it was extremely insightful and enjoyable. It makes me wonder how different a mouse is from a person. I briefly fantasized about Samantha the baby while experimenting on Samantha the mouse. Would she make the same noise if poked with a needle? I imagine she would to some degree. I have another meeting tomorrow with Dr. Streibach, he increased our sessions to twice a week after our discussion on Tuesday, December the 6th, regarding my chosing C answers. It's yet another annoyance I have to suffer through, though I do enjoy his interest in me. I think some day even his bumbling notes will be in a museum, as documentation of my greatness. She's like me, but still less real. I will explain how I discovered this. At her house she showed me to her room. She showed me her books of which she pretended to be very proud. I asked which was her favorite. She paused and looked at me. It was the look Dr. Streibach sometimes gives me, a calculating look. Our eyes met and she smiled. I tapped the binding of the nearest book on the shelf. \"The spines aren't cracked. They've never been opened.\" \"Would you like to see my favorite book, Richard?\" \"Sure, that'd be cool,\" I replied. She went to her bed and pushed the mattress over a small ways exposing the boxspring. There was a cut in the cover of the boxspring which could have been an incidental tear but wasn't. She fished inside and pulled out a thick book entitled \"Anatomy of the Human Body,\" the author's name was Henry Gray. I have heard of it before, Dr. Streibach has a copy on his shelf, but I never thought to look in it. It was glorious. The engravings were beautiful, the renditions of human organs superb. It was so much better than disecting Samantha the mouse. \"Do you like it Alfred?\" she asked me. I tried to hide my excitement. \"I don't know, it's kinda cool I guess.\" \"Drop the act Alfred,\" she said smiling. \"I'm not quite so blind or foolish as your parents or Ms. Stevens. You're like me. That's why you asked about Theodore Bundy. By the way, everyone calls him Ted.\" I might have kept up the act but I could see it was pointless. She stood staring at me, hands on her hips, waiting, calculating. \"I think a man of such esteem deserves the full measure of my respect.\" \"Theodore Cowell,\" we said in unison. \"We're both intelligent, Alfred. It would be mutually beneficial to combine our intellect toward a common goal.\" \"What goal would that be?\" I asked. \"Greatness,\" she replied simply, and I knew it would be good for me to work with her. \"Do you have a psychologist or other mental health professional working with you?\" she asked as we sat on her bed thumbing through the pictures. \"I do,\" I replied pausing to look at an excellent picture of a cat's still beating heart. \"Has he a diagnosis for you?\" I smiled proudly. \"I've been toying with him. He currently thinks I'm OCD, that means...\" We will meet again tomorrow or the next day. She suggested we make a secret language to avoid detection and tell the other students that she is my girlfriend so people don't ask why we spend so much time together. I liked this idea, and the prospect of spending time with her. She likes to hear my ideas for great things to do. The plan, as it currently stands, is that I will lure Mother away from Samantha during her afternoon nap. Next, Katherine will sneak in the house, go up to Samantha's room and take her out of the house. She'll keep Samantha in a hidden place (an old shed I found in the woods last summer while exploring, see entry dated July the 11th). Katherine kissed me before she left, it was very enjoyable. I've begun putting together a \"kit\" for our plan. Just some instruments I want to use in our experiments with Samantha. It is essentially an expanded version of the tools I used on Samantha the mouse. My heart races just thinking about this first great deed in what I can only imagine will be many. We expect to put the plan into motion on December the 24th, as an early Christmas present to ourselves. I want Katherine to kiss me when we're done. The best part about this Christmas is what my parents told me earlier today. Mother is pregnant. Before I met Katherine this would have seemed like a nightmare, but now that we are working together it's actually really exciting. With all the things we learned from Samantha, I can only imagine how informative it will be to experiment on a subject carrying a child!"}
{"url": "https://creepypasta.fandom.com/wiki/A_Matter_of_Time", "title": "A Matter of Time", "author": "their regret until their lives", "publication_date": null, "tags": ["Beings"], "content": "There is a third group; those so tormented by their regrets that ,in their desperation, they show a willingness to bypass all forms of earthly and supernatural law. I refer to this group of people as 'Empty's', for nothing exists within them at this point except for a desire to be rid of their regrets. Occasionally, one or two of these poor souls will, through instruction or sheer luck, gain access to a more 'unconventional' means of absolution. Have you heard of the String theory: a hypothesis proposing the existence of an infinite number universes, each one differentiated by a string of variables and events scattered across millennium of each universes existence? This theory is much closer to reality than what people suspect. Some souls manage to break the ancient seals of the earthly realm. Fueled by their selfish desire to rid themselves of their regret, they call upon ancient, unspeakable magics to erase their universe, its life, its achievements, and, of course, their own regrets along with it. Once this phase of the ritual is complete, the Empty is given a choice whether to continue in their pursuit of a new life or to accept their current one. If an Empty chooses to withdraw from the ritual, they will wake up at the location where they summoned the spirits of time but will be unable to remember doing so. They will live the rest of their lives with perfect memory, remembering always the best and worst times of both their past and future, a small price to pay for such a selfish whim. If an Empty chooses to continue with the ritual, then both I and the spirits are rendered powerless to stop them. Once a link has been forged between two universes, the gateway will be exposed to The Void and the timeless, ancient horrors which dwell within it. This is the most dangerous stage of the ritual. Once a successful Empty completes the crossing, the forces of the Void will stream into the old universe, consuming it and all its inhabitants and claiming the universe for the Void. The Empty, however shall be safely warped to their new universe, starting their lives afresh from birth as they seek to remodel their old lives into one with no regrets. My greatest fear, however, is for myself, for the beasts of the Void, in their hatred of humanity, must detest and revile their creator even more so. I fear that I am powerless against such blind fury. Humanity has many flaws, but their worst is their fixation on their regrets. That is my greatest sin and my greatest regret; to have doomed humanity from the beginning. I know not what fate awaits humanity. And I know not what fate awaits me; a powerless god. It is only matter of time."}
{"url": "https://creepypasta.fandom.com/wiki/A_Mask", "title": "A Mask", "author": "FlakyPorcupine Content is avail", "publication_date": null, "tags": ["PokéMon", "FlakyPorcupine"], "content": "Will I ever be free? Will I ever be free of this tormenting life after death? To exist as a ghost wandering around in my own despair, just longing to be put back to rest? I remember how peaceful the long rest was. There I was, sleeping in my ancient tomb without a thought to the living. Complete solitude. I was not being a bother to anyone living. But all I have left is this damned mask that taunts me so. I can’t be separated from it. Everywhere I go, it trails behind me. Everywhere I turned; it would follow me like a long lost puppy. What sick, twisted monster would torture us so? I took out the mask, my mask... Except it was not always a mask, it was once my face. Hesitant, frail tears came to its eyes as I gazed upon it. My face... was once so beautiful... All I could do was stare at the mask, and weep silently to myself. I can never be free."}
{"url": "https://creepypasta.fandom.com/wiki/A_Man_with_Two_Lives", "title": "A Man with Two Lives", "author": "himself. Duck is an old man liv", "publication_date": null, "tags": ["AGB", "Military"], "content": "\"In the autumn of 1866 I was a private soldier of the Eighteenth Infantry. My company was one of those stationed at Fort Phil Kearney, commanded by Colonel Carrington. The country is more or less familiar with the history of that garrison, particularly with the slaughter by the Sioux of a detachment of eighty-one men and officers—not one escaping—through disobedience of orders by its commander, the brave but reckless Captain Fetterman. When that occurred, I was trying to make my way with important dispatches to Fort C. F. Smith, on the Big Horn. As the country swarmed with hostile Indians, I traveled by night and concealed myself as best I could before break. The better to do so, I went afoot, armed with a Henry rifle and carrying three days' rations in my haversack. \"They waited. For two days and nights, crouching behind a rock topped with a growth of mesquite, and with the cliff at my back, suffering agonies of thirst and absolutely hopeless of deliverance, I fought the fellows at long range, firing occasionally at the smoke of their rifles, as they did at that of mine. Of course, I did not dare to close my eyes at night, and lack of sleep was a keen torture. \"I remember the morning of the third day, which I knew was to be my last. I remember, rather indistinctly, that in my desperation and delirium I sprang out into the open and began firing my repeating rifle without seeing anybody to fire at. And I remember no more of that fight. \"'Dave Duck,' I answered; 'who should I be?' \"He stared like an owl. \"'Sure,' he answered—'just as I told you. It was Dave Duck, all right; most of us knew him. And now, you damned impostor, you'd better tell me who you are.' \"I'd give something to know,' I said. \"A week later, I escaped from the guardhouse and got out of the country as fast as I could. Twice I have been back, seeking for that fateful spot in the hills, but unable to find it.\" Credited to Ambrose Bierce"}
